{"Daily-notes/2022/10.-Oct-22/23rd-Oct-2022":{"title":"23rd Oct 2022","links":["Links--and--Lists/BIG-Decision-List","Links--and--Lists/Task-List","tags/John","Main-Notes/Church/Prayer-List","Links--and--Lists/Great-Series-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["John","DailyNote","Ready"],"content":"General thoughts on today\nAs normal with these types of endeavours life gets in the way. I need to get into a regular discipline and keep to it… so attempt number 2 :)\nBig discissions on the horizon:\n\nMove to West Wales\nThe choice of high school for Isaac\nSet for Dartmouth\nAccommodation for Dartmouth or drive\nI’ve added these to a BIG Decision List to keep track of the key things I need to sort out and a lower levelTask List for day to day stuff I need to cross off. Also added links to the template so I don’t forget them.\n\nWork\nNot much to note.\nThe Data Visualisation module is currently being fixed - a number of defects and there’s question on whether there is enough resources to use it across a wide group of people.\nBut the bigger piece of work is now documenting the dataflows in JPA and getting the team to the level of understanding where we can run our own reports. This linked to the Python work means we will finally have a fully capable team… no pressure.\nExercise\nHas been slipping - I’m managing to get one session in a week and I’m still walking Isaac to school but I feel like I’m not keeping up what I need. So another area of focus.\nPrayer\nReading\nJohn 7:37-38\n\n37 Now on the last and most important day of the feast, Jesus stood and called out [in a loud voice], “If anyone is thirsty, let him come to Me and drink! 38 He who believes in Me [who adheres to, trusts in, and relies on Me], as the Scripture has said, ‘From his innermost being will flow continually rivers of living water.’”\n\nThoughts\nRivers of living water - the holy spirit, Christian agency flowing out into the world from the hearts of those who truly believe.\nPrayers\nWent through Prayer List and prated for those who are ill at this time.\nComputer\nI’ve been making great strides in my python work…generative art has really helped improve my base coding in Python and giving me an excuse to code everyday. Over future entries I’ll start adding some in as they’re finished.\nAt the moment I’m working through using flow fields and the work of Tyler Hobbs (website) has been a great inspiration.\nTV\nAlmost finished Supernatural - such a great series…15 seasons :) Added it to my Great Series List list.\nFood\nLike exercise this needs to improve - too many take aways and crappy food.\nLife\nI never seem to get to this section as much of what occupies me is covered above but probably this is the section I need to work on most.\nThings seem to be ticking along at the moment - in the right direction. I’m struggling to juggle everything time wise, which is a perennial problem for me. The move to West Wales sits on my mind a lot. Mainly I’m torn over if it’s the right thing for Isaac. The other aspects (my Dad, friends, work) will all work out… but for Isaac this will be such a hard challenge and sets a point in his timeline of ‘What if…‘.\nEveryone says to just go for it - but they’re not as invested in the outcome…no skin in the game so to speak.\n\nTags:DailyNote\nStatus:Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/10.-Oct-22/24th-Oct-2022":{"title":"24th Oct 2022","links":["Links--and--Lists/BIG-Decision-List","Links--and--Lists/Task-List","tags/Isaiah","Main-Notes/Church/Prayer-List","Main-Notes/Python/angle_between.py","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["Isaiah","DailyNote","Ready"],"content":"General thoughts on today\nToday Isaac went off on his first school away trip to Abernant, a whole 4 nights away from us with no contact. This will be the fist time we’ve been out of contact with him for more than a day, and the longest time he’s been away outside of close family.\r\nHe was a little nervous this morning but after talking to a few of his friends parents I think he’s done super well. Poor George has been in tear and his mum has written him daily notes.\r\nSo we’ll see how he does…\r\nCrossed something off the BIG Decision List the strategy day in November. It’s my birthday week and was on the Wednesday…and they’re more PR days than genuine strategy engagement sessions. So does it make the boat go quicker - no.\r\nCrossed off the sleeping bag from the Task List and the passport photo (fingers crossed)\nWork\nQuiet day today although I have reached out to Kal from the Emerging Leaders course to build that relationship.\nExercise\nNone - and as we’ve come to West Wales I suspect that little will be done this week. Although if the weather is nice I might go for a walk Wednesday.\nPrayer\nReading\nIsaiah 54:10\n\n“For the mountains may be removed and the hills may shake,\nBut My loving kindness will not be removed from you,\nNor will My covenant of peace be shaken,”\nSays the Lord who has compassion on you.\n\nThoughts\nA reminder that of all the certainties in life the love and kindness of the Lord and his peace are eternal and unshakeable.\r\nIn a changing world he is constant.\nPrayers\nSo today my prayers have been for Isaac and his trip. Prayers of safety and courage and prayers of friendship through shared experience with his class mates.\r\nPrayer List\nComputer\nNot had much time today with the drive West but I have tweaked my angle_between.py code.\nTV\nThe film Tenet - hard to follow but a great concept.\r\nNot sure I’d recommend it.\nLife\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/10.-Oct-22/27th-Oct-2022":{"title":"27th Oct 2022","links":["Links--and--Lists/Task-List","Links--and--Lists/BIG-Decision-List","tags/Matthew","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["Matthew","DailyNote","Ready"],"content":"General thoughts on today\nBusy old day - Thursdays tend to be.\r\nBut productive, got a few things off the Task List and a few things from the BIG Decision List.\r\nMainly everything for Dartmouth…going to drive there and back in one day and picked out the set for me and the Boy.\r\nWe’re still missing Isaac although from the photos posted on twitter he’s having a great time!\nWork\nBusy as well…analytics practice session delivered and a few other meetings in the bag.\nExercise\nStill slipping…need to pick it up.\nPrayer\nReading\nMatthew 10:16\n\n16 “Listen carefully: I am sending you out like sheep among wolves; so be wise as serpents, and innocent as doves [have no self-serving agenda].\n\nThoughts\nI was chatting to Steph about Stuart in work, who is a committed Christian, and how he’s taken the decision to move away from his non-Christian friends and family. Even his cousin who he was close to growing up is now on the side lines as they’re on different paths… I’ve known a few Christians take this view and it always strikes me as running against what we’re taught in the bible. And for me this passage backs that feeling up. He sent us out to be disciples, sent us out amongst the wolves…not staying in safe communities of believers.\nPrayers\nI added Hannah to the Prayer List today.\r\nShe’s having issues with her back, which is causing problems riding the horses and even sitting too long in one place. Odd for a 16 year old. They’ve done scans on her lower back but haven’t found anything.\r\nSo prayers…\nComputer\nWorked on the Jessica algorithm…more flow field magic. This time with random circles.\n\nTV\nFinished the Watcher…it was good and apparently based on a true story.\r\nNot sure it’s one for the recommendation list but it passed the time.\nFood\nNice spaghetti and meatballs…with caprese salad.\nLife\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/10.-Oct-22/28th-Oct-2022":{"title":"28th Oct 2022","links":["tags/1Corinthians","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["1Corinthians","DailyNote","Ready"],"content":"General thoughts on today\nIsaac came back home today after his adventure at Abernant.\r\nHe had a great time and did so much.\r\nThe biggest take away I think was him confronting things he would normally shy away from - and learning that he can do anything he sets his mind to.\nExercise\nWent and got a coffee this morning - so got some fresh air :)\nPrayer\nReading\n1Corinthians 13:6\n\n6 It does not rejoice at injustice, but rejoices with the truth [when right and truth prevail].\n\nThoughts\nLove and truth…\r\nLove should be unconditional and so nothing should be hidden. It’s a hard path.\nTV\nStarted watching the Boys.\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/10.-Oct-22/29th-Oct-2022---DJ-Day":{"title":"29th Oct 2022 - DJ Day","links":["tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"Kind of a non-standard post for today…\r\nSpent most of the day driving too and from Dartmouth for the Waxnerds gig @the Dolphin.\r\n…and whilst there Isaac played his first DJ set and did amazing!\n\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/11.-Nov-22/2nd-Nov-2022":{"title":"2nd Nov 2022","links":["Main-Notes/Exercise/Templeton-Home-Set","tags/Psalm","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["Psalm","DailyNote","Ready"],"content":"General thoughts on today\nWork\nOnline training and pushing Jack and Cellan to take a lead on their areas more.\r\nThey’re both capable but tend to sit in their comfort zones - so time to push them on.\nExercise\nNone today - recovery day after yesterday’s set, which I actually need to document Templeton Home Set\nPrayer\nReading\nPsalm 23:1-2\n\nThe Lord is my Shepherd [to feed, to guide and to shield me], I shall not want.\nHe lets me lie down in green pastures;  He leads me beside the still and quiet waters.\n\nThoughts\nI have an enduring love for this Psalm and it has cropped up in my life on a number of occasions.\r\nClive (the former Pastor in St Julians) used it as the focus in the last series of sermons he delivered before retirement. My Uncle David had it played at his funeral - this is my fave version Psalm 23: Stuart Townend\r\nSo much packed into it.\r\nThe recuring metaphor of being sovereign and shepherd - king, provider, guide and defender all rolled into one… and because of faith in him I shall not want. It’s something I’ve wrestled with…the thought that you can give yourself completely over to faith and be given all you need. It’s a big step to take, the blind faith that if he is truly your Lord he will provide all your ‘wants’, yet here it is spelled out. And because He provides, He gives us those quiet calm places to rest - cool grass and quiet waters.\nPrayers\nToday I prayed for all those who have yet to find their way to Him and be guided to those green pastures (Prayer List).\nComputer\nToday I started my Game of the Month - Disco Elysium.\r\nAn interactive detective novel and so far really engaging.\nFood\nWe’re off out to Tenby tonight with Steph’s parents to try the Bay tree.\nBay Tree was lovely…good food and great staff. although I’m not sure Isaac appreciated the ghost story of Margret.\nLife\nAfter a very relaxing couple of hours on my own playing DE Steph and Isaac came home - with Isaac upset with himself.\r\nSteph had an up and down day with him as he has been finding people frustrating and was worried about ruining the meal tonight. According to him that’s what he always does, get frustrated and then gets into trouble.\r\nPoor thing had really worked himself up about it and it obviously had been playing on his mind.\r\nSo…me and him had a cwtch on the sofa and talked through how he was feeling.\r\nAt the heart of it is an awareness of how previous nights out have played out. He cited a meal out with the girls to the Boars Head and our most recent visit to Vitorios, where I’d insisted he not wear joggers. On both occasions he had to make compromises that frustrated him and led to him losing his temper… kind of a theme in that he really likes to get his own way.\r\nWe talked it through and came to the agreement that it’s better to talk feelings through and share what’s going on, but to also listen to other people’s ideas. The example I gave was his recent Taekwondo grading where he insisted everyone was going to wear their TKD t-shirts and I wanted  him to wear his gi. In the end we compromised (t-shirt under the gi) and when we arrived everyone was very formal - but this was a good example of him sharing what was frustrating him and then listening, and finding a compromise.\r\nShare - listen - compromise\r\nThis might need some reinforcing :)\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/11.-Nov-22/4th-Nov-2022":{"title":"4th Nov 2022","links":["Links--and--Lists/BIG-Decision-List","Links--and--Lists/Task-List","Main-Notes/Exercise/Templeton-Home-Set","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nEnd of another week…which ended up being productive and chilled (best combination).\r\nWe’re all suffering with colds so it’s also been a PJ day, but I think we’re through the worst of it.\r\nSteph’s AC has been fixed (yesterday) - just in time for winter. Bless her Dad he paid for it all and they had a day together in Haverford West. Yesterday wasn’t the best day as Isaac wasn’t on his best behaviour (more on that below).\nSo the next WaxNerds event is booked for Feb - added this to the BIG Decision List. Along with a few odd jobs on the Task List\nExercise\nRest day today but did a Templeton Home Set yesterday.\nComputer\nIn my generative art journey I’ve started looking at circle packing. Initially this was inspired by some coral type art I came across but it seems a useful technique to have in the toolbox.\r\nInitial attempts below show drawing and structuring circles (with optional collision detection) but I want to really delve into how to pack each circle closer together.\n\r\n\nLife\nSo there’s a recuring theme recently with Isaac.\r\nHe’s getting that stroppy teenager attitude early (he’s only 10) but then when he’s challenged on it going into this self deprecating ‘I aways mess things up’ spiral.\r\nNo I’m not sure if this is a form of manipulation to get himself out of trouble or a sign that his view of himself is really fragile.\r\nEither way it need careful handling and often it doesn’t play well with Steph’s anxiety and mental health.\r\nI’ve started making a conscious effort to scold him less and take time to talk to him more and I’m hoping keeping this journal will help me keep consistent in the advice and support I give. But he doesn’t half make it hard! However, it also makes me reflect on how I treated my mother and the way I would pull on the heart strings in order to get out of trouble or get my own way. I really do suspect Isaac is like me in that way.\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/9.-Sept-22/13th-Sep-2022":{"title":"13th Sep 2022","links":["Main-Notes/Exercise/Mixed-set","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nA busy couple of days has left little time to Journal but it’s slowly coming together.\r\nNext on the list is setting up a GitHub connection\nWork\nExercise\nWalked Isaac to school and went through Mixed set.\nPrayer\nReading\nDeparting from my normal spoon fed App passage, today Luke has stoop out to me - the story of the Penitent Theif\n\n39 One of the criminals who had been hanged [on a cross beside Him] kept hurling abuse at Him, saying, “Are You not the Christ? Save Yourself and us [from death]!” 40 But the other one rebuked him, saying, “Do you not even fear God, since you are under the same sentence of condemnation? 41 We are suffering justly, because we are getting what we deserve for what we have done; but this Man has done nothing wrong.” 42 And he was saying, “Jesus, [please] remember me when You come into Your kingdom!” 43 Jesus said to him, “I assure you and most solemnly say to you, today you will be with Me in Paradise.”\n\nThoughts\nFor me this is central to the simplicity of the Christian Faith.\r\nNo baptism, no confession of sin…just acceptance of who Jesus was.\nComputer\nContinue to get lost in 7DtD…I’m not even sure I like the game that much but it seems to be evaporating time… I think i’m using it as a distraction from getting on with other things. It’s easy problem solving and lazy of me really.\nTV\nLast Kingdom Series 5\nFood\nChilli - I should really start putting recipes on here.\nLife\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/9.-Sept-22/14th-Sep-2022":{"title":"14th Sep 2022","links":["tags/Bible-Sacrifice","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["Bible-Sacrifice","DailyNote","Ready"],"content":"General thoughts on today\nMain highlight of today was having Cristyn’s girls over after school for an hour.\r\nIsaac always enjoys having people over, even if he’s often not the best host, but they all had fun drawing Pokémon balls that open to show their favourite Pokémon (Charmander, Squirtle and of course Pikachu). All while feeding them on chocolate and squash - which we all promised not to tell Cristyn about :) …with Steph keeping Alys entertained…which she loved doing, such a smiley baby.\nAlso we had a visit at Isaac’s school, partly as a welcome to year 6 and partly to run through the week he has away in October. Outward bounds adventuring - I hope he loves it.\nI’m also going to try and keep this Journaling to a specific topic each week. More to try and make some headway on a few of the ideas I have…it’s easy to get put by not knowing where to start. I did think about going back to my blogging days and having a topic per day but I think changing it to a week will allow me to get into a topic in more depth.\r\nI’ll still keep these going as notes on the day.\nWork\nContinues to tick over.\r\nAlex is back from holiday so it was good to have him help out with a few chases.\r\nAlso I found out that Jacqui Chub is working in Data Protection which means I’ll probably need her advice from time to time. It was good to connect and she’s now in Pembs as well.\nExercise\nMainly walking - too and from school.\r\nWhich Isaac didn’t complain about!\r\nHe’s been a delight today and was really good with the girls when they came over and was the perfect host getting them drinks and snacks. I even offered for him to have his Xbox back for the evening as a reward and he said no - I’ll save it for another evening (super proud!).\nPrayer\nReading\nToday was John 10:11\n\n11 I am the Good Shepherd. The Good Shepherd lays down His own life for the sheep.\n\nBible-Sacrifice\nThoughts\nThe fourth of the memorable “I am” statements.\r\nFor me this sets out a promise from Jesus as our sovereign and the example that all leaders should aspire to. He will (and did) sacrifice his own life for the good of us (his flock). If you are committed and invested in people then you put yourself in danger to save them.\r\nIt’s core to what happened on the cross and central to how we should aspire to be.\nPrayers\nSo today is all about finding Jesus in my Prayer List.\r\nHoping that all those without faith (for a variety of reasons) come to know and trust in the Lord like I do. It still surprises me sometimes that I do…funny how life works out and paths find their destination.\nComputer\nTV\nLast Kingdom…\nFood\nLunch - Steph’s Rainbow Salad and smoky tofu\r\nDinner - No Chicken Kiev’s  and Sauté potatoes\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/9.-Sept-22/6th-Sep-2022":{"title":"6th Sep 2022","links":["Main-Notes/Exercise/Mixed-set","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"Exercise\n\nWalked Isaac to school\nWeights based on new Mixed set\n\nWork\n\nDemo’d ML Proof of concept to SSCL Defence Exec - lots of interest and follow up\n\nWork up internal opportunities based on attrition and call forecasting\nIdentify key client opportunities\nset up exploratory working group\ninvestigate potential of Machine Learning in VBA\n\n\nSet up Defence Questor access\nEmailed Bev Pink about setting up a call in relation to the OASIS Showcase\n\nPrayers\r\nTodays reading was from Psalms\r\nSet up Prayer List\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/9.-Sept-22/7th-Sep-2022":{"title":"7th Sep 2022","links":["_assets/Templates/Daily-Entry","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General Update for today\nStill in the process of setting this up.\r\nSo, today I’ve enabled syncing from the laptop to GDrive and then out to my mobile, giving me the ability to update and keep these notes where ever.\r\nI’ve also set up some templates for the daily updates - to keep it organised and act as a prompt.\r\nI’m hoping that this will help keep me on track - time will tell.\nTemplate set up\nI’ve created a template folder with a Daily Entry file.\r\nThis covers the following main areas:-\n\nGeneral thoughts on today\nWork\nExercise\nPrayer\nComputer\nTV\nFood\nLife\n\nI might add a few notes under the headings in the template to again keep me on track.\nPrayers\nTodays passage was from Romans 10:9\n\n9 because if you acknowledge and confess with your mouth that Jesus is Lord [recognizing His power, authority, and majesty as God], and believe in your heart that God raised Him from the dead, you will be saved.\n\nThoughts\nI always love the passages in the bible that keep it so simple. Acknowledge Him, talk about Him, and in your heart believe! …and you will be saved.\r\nIt reminds me of the sermon in Molleston Baptist church (21st Sept 2022) and the thief who was crucified next to Jesus. No doctrine, no sacraments, no works… just the guy on the middle cross said to come - so I came.\nPrayer\nToday I went through the Prayer List and lifted up those who are ill.\r\nSo many people in poor health!\nDailyNote\r\nwww.pembrokeshirehistoricalsociety.co.uk/the-story-of-molleston-baptist-church/\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/9.-Sept-22/8th-Sep-2022":{"title":"8th Sep 2022","links":["tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nThis is one of those historic days - one that saw Queen Elizabeth II pass.\r\nLot’s of thoughts, mainly how weird it will be not having a Queen. Her first Prime Minister  was Winston Churchill! So much wisdom and experience there, part of political life but separate from it. She’ll be missed as we no longer have that constant at the heart of the nation.\r\nSuch an embodiment of Christian life - unwavering faith and her love and service to her people.\nIt’s one of those moments where you’ll always remember where you were and who you were with. For me I was at home with Steph, Isaac and my Mum &amp; Dad.\nWork\nWork was quiet - Alex is off and there was nothing urgent that needed doing.\r\nI am finding it difficult keeping on track with it being so quiet but still making good progress…more later once this Journal project settles down.\nExercise\nWalked Isaac to school and went to get a coffee at the ridgeway.\r\nShould have done some weights but the news derailed that idea.\nPrayer\nReading\nTodays reading was Ephesians 5:1\n\nTherefore become imitators of God [copy Him and follow His example], as well-beloved children [imitate their father];\n\nThoughts\nInteresting how yesterday’s reading was about the easy of salvation - just believe. Followed by the impossible challenge that salvation brings… imitate God through his example in the life of Jesus.\r\nFree entry to the hardest obstacle course with the knowledge that you’ll never fall - just be put on to try again.\nPrayers\nToday I think it’s all about thanks for the life and example of the Queen.\nComputer\nStill continuing to get to grips with Obsidian and this Journal.\r\nAlso playing 7 Days to Die - it’s ok…\nTV\nWall to wall coverage of the death of the Queen.\nFood\nChinese - comfort food for a sad day\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2022/9.-Sept-22/9th-Sep-2022":{"title":"9th Sep 2022","links":["tags/QueensDeath","tags/AnalyticsPractice","tags/BBC","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["QueensDeath","AnalyticsPractice","BBC","DailyNote","Ready"],"content":"General thoughts on today\nAnother day of reflection on the passing of the Queen (QueensDeath ). Boris Johnson’s speech in the Commons stool out both for the deft personal stories he told and the way he insisted on calling her Elizabeth the Great - I wonder if that will stick.\nWork\nWork carries to tick along.\r\nToday I finally launched the Analytics Practice for SSCL DefenceAnalyticsPractice\r\nIt was good to get it launched and it will be even better to get the first tranche of workshops out of the way. Similar to when we delivered this into Government it was very much half hour of me talking away with very little engagement. But I’m hopeful things will pick up.\nThe bigger challenge for next week is continuing to get to grips with the various strands of the Resourcing data. My current thinking is that there are three base datasets needed:-\n\nResource - who is in the organisation, which area, what role and how much they cost (including current vacancies)\nActivity - what the resources are booking their time to\nDemand - the horizon in terms of what roles are needed on what projects.\n\nThere is a potential gap in that we’re not tracking the BAU demand - but I’m hoping this can easily be extrapolated from the weekly activity data.\nExercise\nA day of walking as I had to pick up Isaac.\r\nSo a walked down to St Mary’s to drop him off and then back later to pick him up.\nPrayer\nReading\nJames 1:19\n\nUnderstand this, my beloved brothers and sisters. Let everyone be quick to hear [be a careful, thoughtful listener], slow to speak [a speaker of carefully chosen words and], slow to anger [patient, reflective, forgiving];\n\nThoughts\nThis is one of those verses that is just universally true and so forgotten by many people.\r\nWe need more active listening in life, people eager to hear others, their perspective, their thoughts…and less voicing our opinions until we have listened and digested what has been said…and finally listening without that emotional engagement that leads to anger - don’t let someone’s careless phrasing spark a reaction, spark anger. Wise words indeed.\r\n#ListenMoreSpeakLess\nPrayers\nMore reflections and prayers for the Queen’s family and the new King.\nComputer\nGetting more into 7DtD but\nTV\nMostly TV has been following coverage of the Queen’s death - it seems most other activities (sport, theatre, the proms) have all been cancelled.\nFood\nBBC\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2023/4th-Jan-2023":{"title":"4th Jan 2023","links":["tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"Momentous day my boy became a man…although telling me in Wickes was a bit strange.\r\nStill…a day worthy of note.\nLot of other stuff I’m trying to sort out but more on that later.\nTonight…a list of things that I like to do.\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/11th-Nov-2024":{"title":"11th Nov 2024","links":["Themes/Blogging","Main-Notes/Cheat-Sheets/NeoVim","Main-Notes/Isaac/1.-Rules/Rule-1---Have-Faith","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nBack once again like a renegade master!\nI’ve a love hate love relationship with Blogging and journaling. It’s such a great idea and yet discipline lets me down.\r\nNever mind - time to try again lol\nSo today I’ve installed this on my main computer and linked up the files to the newly discovered github repo I had… so changes are now heading off to GH and hopefully getting pulled back down onto the laptop. Time will tell.\nI also need to put a cheat sheet in for NeoVim which has become by new fave editor.\nThe big achievement has been finishing Rule 1 - Have Faith\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/12th-Nov-2024":{"title":"12th Nov 2024","links":["Links--and--Lists/Task-List","tags/test","Links--and--Lists/Great-Series-List","tags/DailyNote","Themes/Daily-Notes"],"tags":["test","DailyNote"],"content":"General thoughts on today\nSo today I’m continuing getting back into blogging and my Obsidian set up.\nI want to achieve 2 things today on that subject:\n\nAdd Tasks that can be tracked globally\nGet Copilot working from inside Obsidian\n\nBoth seem straight forward from what I’ve seen.\nSo here are some test tasks:\n\n ⏬ Testing Task ✅ 2024-11-12\n 🛫 2024-11-12 📅 2024-11-13 🔼 🆔 1 Test 2 ✅ 2024-11-12\nLots of Meta data options that I’m not sure would be useful (maybe).\n\nFollowing the advice here publish.obsidian.md/tasks/Getting+Started/Getting+Started I’ve added the code to pull all the open tasks and completed tasks into the central Task List. Really nice feature.\n\n test Testing Tags in Tasks ✅ 2024-11-18\n Testing Tags in Tasks ✅ 2024-11-12\nIt works well.\n\nFor getting co-pilot running - it required an API key which my ChatGPT subscription doesn’t provide - which seems a little tight given the cost. However, Google does provide a free tier API access… so I’m now using Gemini :FarFaceSmile:\nExercise\n\nPush-ups:: 60\nFree Squats:: 60\nKettlebell swings:: 60\nSteps:: 6000\n\nComputer\nMore Obsidian setup, config and exploration.\nTV\nFinished Dexter last night so need to find something new.\nJust on Dexter, I thought it was a solid ending to a good on-going series. Some people have said it dropped in quality after Series 4, but I thought it was solid throughout it’s run. I’ve added it to Great Series List.\nLife\nThe question of today is whether Isaac should continue with Youth Club.\nA while ago I said that I wanted him to do a range of activities after school, broadly being:\n\nA martial art\nAn instrument\nA sport\nSomething social\nAnd he was doing Tae-kwon-do (martial), Learning the Bass (instrument), and going to Youth Club with the church - just a sport to find.\nNow I’d thought about tennis, but he wanted to try golf… which is fine with me, despite me not being a fan.\nI’d also said to him that if he wanted to stop doing Youth Club he would have to find something else to do…\nSo here’s the problem…\nHe sees golf as being the Youth Club replacement, I see it as the missing sport.\nAdded to that is also the fact that Youth Club means I can have some time with Steph.\n\n\nTags:DailyNote\nStatus:: Complete\nThemes &amp; links: Daily Notes\nLIST\nWHERE Status = &quot;Complete&quot;"},"Daily-notes/2024/November/13th-Nov-2024":{"title":"13th Nov 2024","links":["Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nNew day, and on the list is a venture up to Newport Pembs for a walk and maybe some food, followed by driving back to Newport Gwent (All the Newports today).\r\nI do want to get Obsidian working back on my laptop for while I’m away and ideally get it working on my phone. The main hurdle being integration with GitHub - before I used Google Drive and a mobile sync app.\n\n ⏫ Obsidian on Laptop ✅ 2024-11-14\n\nNow I’ve got Tasks working on this I’m going to try and use it as my central place to keep track of things I need to get done. So a few that have been around for a while:\n\n 🔼 Register with a local Dr in Pembrokeshire\n 🔼 Complete PSA Test and send back to lab\n 🔼 Complete Bowl Cancer Check and send back tot he lab\n 🔼 Book Skin Cancer Screening\n\nWork\nAs it’s a Wednesday I’ve go a half day so hopefully a quiet one.\nExercise\nPrayer\nReading\nThoughts\nPrayers\nPrayer List\nComputer\nTV\nFood\nLife\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/14th-Nov-2024":{"title":"14th Nov 2024","links":["tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nMain focus of today has been getting on top of a few things in work. I’m still debating how to use Obsidian for work…should I use it…if I do should I start a separate vault???\nExercise\nPush-ups:: 70\nComputer\nWorked out that getting git on Android isn’t simple…TMux seems to be the answer but that needs to be running all the time to trigger the cron jobs to refresh content. Seems less streamlined than it need to be.\nAdded Admonition into the plugins\nTV\nMainly YouTube as I’m in Newport on my own.\r\nThe focus seems to be around Obsidian how to’s lol\nFood\nCheese on toast for lunch. Pasta for Dinner.\nLife\n\nTags:DailyNote\r\nStatus:Ready\r\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/16th-Nov-2024":{"title":"16th Nov 2024","links":["Links--and--Lists/Podcast-List","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nLocation:: Newport\nBirthday meal out with the family at Vittorio’s - lovely time with everyone there.\nUpdated the Podcast List adding categories and summaries.\nGod\nPrayer List\nWent through the people on my list needing healing. Also updated the list and included a tableto help track and keep notes.\nExercise\npush-ups:: 0\n\nTags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/17th-Nov-2024":{"title":"17th Nov 2024","links":["tags/49Goals","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["49Goals","DailyNote","Ready"],"content":"General thoughts on today\nThe eve of my 49th Birthday!\nLocation:: Newport → Templeton\nFunny old day, kind of a lul day between a fun and difficult Friday night (watching Ecobelly) and a nice family day yesterday at Vittorio’s.\nWent to church where the service was based around the output of the 24 hour of Prayer event they did.\nIsaac had a little passage left for him as part of that:\n\n…and Steph did a reading based on some of the themes and messages that had been left during the event.\nThen Sy read the book of Ephesians - yep all 6 Chapters - which for a sermon was different.\nThe rest of the day has been travelling back west ready for the start of a busy old week and more birthday celebrations.\nSo I need to get some goals in place for my 49th year - (50th loop of the sun).\n\n 49Goals 🔼 Get back into shape\n 49Goals 🔼 Start a creative endeavour\n 49Goals 🔼 Complete Move to West Wales\n\n\nTags:DailyNote\nStatus:Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/18th-Nov-2024":{"title":"18th Nov 2024","links":["Links--and--Lists/BIG-Decision-List","Links--and--Lists/Task-List","82-Allt-yr-yn","Themes/Isaac","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nLocation:: Templeton\nBIG Decision List\nTask List\nIt’s my 49th Birthday! Starting my 50th revolution around the sun.\nFeels a strange one this year - don’t know why, getting old maybe, disconnected maybe. But life moves on and I’m hoping that keeping this journal and notes will help put some direction in things. It has felt a little aimless of late. Reflecting on it I think a big part has been the house sale and completing the move to West Wales. The bungalow is lovely, but it is small and doesn’t feel like a permanent place for us all. So, fingers crossed the sale of 82 Allt-yr-yn goes through soon.\nThings that cropped up over the weekend that I need to do:\n\n ⏫ Send off electricity safety certificate to the solicitor. ✅ 2024-11-20\n 🔼 Pay the electrician. ✅ 2024-11-20\n 🔼  Buy a replacement door handle for Potters Grove\n 🔼 Fit the replacement door handle for Potters Grove\n\nPresents\nSo Steph got me some super useful bits and bobs I’d asked for… small thermos for carrying milk while hiking, small torch I’ve wanted for a while, my fave aftershave (Chanel Bleu). But Isaac bought me this super sweet book “Dad, I want to hear your story”, basically a journal style book with lots of questions for me to answer. Kind of like what I’m doing with part of this Journal, but with more structure. I’m going to fill it out but also add the best bits to the Isaac section of this.\nGod\nPrayer List\nPart of my dislocation I think has been where I am with my walk in faith. Again it feels like a dislocation. I go back to St Julians and it’s so vibrant and active and I miss that, I miss the people. The Bridge here feels like it wants to be something but there’s something holding it back. There feels like a tether reining things in.\nHopefully the leadership course will help - which reminds me I need to send John some feedback on the first session:\n\n 🔼 Send John feedback on the first session of ‘Equipped to Serve’ course.\n\nToday I also added to the prayer list Sam and Isaac… to help both come back into a relationship with Jesus and carry on their walk in faith.\nExercise\npush-ups:: 0\nComputer\nTV\nCurrently Season 3 of the Lincoln Lawyer.\nFood\nToday, as it’s my birthday, it’s going to be a breakfast at Ultracomida and dinner at Dragon Palace.\nLife\n\nTags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/19th-Nov-2024":{"title":"19th Nov 2024","links":["Links--and--Lists/Task-List","digital-garden","Main-Notes/Church/Prayer-List","Main-Notes/Church/My-Theology-Notes/If-Jesus-Was-a-Jew,-How-Does-His-Message-Speak-to-Everyone","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nLocation:: Templeton\nTask List\nSomewhere along the way I’ve lost my Domain names - must have missed the renewals.\nSo looking at this as more of an opportunity than a disaster I had a look around for new options for domain names.\nI found that [g-mac.uk] was available - so I registered it.\nI’ve been coming across the term digital garden and thought that I’d use this domain to both host a version of my digital garden as well as pull together some of the stuff I’ve done previously. Like a one stop shop.\nThe problem with this idea is that it will likely turn into a mechanical project of endless tinkering and take me away from writing… but then it is the tinkering I enjoy.\nGod\nPrayer List\nSteph went to the Alpha course last night - episode 2 Who is Jesus.\nShe’s enjoying the course and getting a lot from it I think.\nOne of her questions, which I think is a good one to add into my research, is\n“Jesus was a Jew so why does what he say have relevance for us?”\nFirstly I reached for some of the teachings of Paul - which always feels that little bit removed from the Gospels.\nTo dig deeper into Steph’s question, I looked into Jesus’ ministry and its scope, starting with His own words and actions. Summarised here: If Jesus Was a Jew, How Does His Message Speak to Everyone\nExercise\nPush-ups:: 70\nFree Squats:: 50\nKettle Bell Swings:: 40\nComputer\nTV\nFood\nTea:: 4\nMorning\n\nthe crusts from Isaac’s toast\n\nLunch\n\nPorridge\nNuts\nCoke Zero\n\nAfternoon\nDinner\n\nBurger Beans and Chips\n\nSupper\nLife\n\nTags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/20th-Nov-2024":{"title":"20th Nov 2024","links":["tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nLocation:: Templeton → Carmarthen → Cardiff → Templeton\nBusy old day so not a lot of notes.\nWent to see lack of Afro in Clwb Ifor Bach with Sam.\ngood to catchup and a nice relaxed gig.\n\nTags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/21st-Nov-2024":{"title":"21st Nov 2024","links":["Links--and--Lists/Task-List","tags/Idiot","Main-Notes/Church/Prayer-List","Links--and--Lists/Great-Series-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["Idiot","DailyNote","Ready"],"content":"General thoughts on today\nLocation:: Templeton\nTask List\nI’ve just trialled talking to ChatGPT - another game changer. It’s the first time I’ve had a chat with a computer and it’s just flowed like a real conversation.\nIt reminds me of one of the issues I always had with Star Trek - they always talked to the computer without a keyboard in site. I can now see that happening. I also showed Steph, she hated it lol.\nToday’s question is about how to link these Obsidian notes to an online Digital Garden.\nI like the simplicity of Obsidian and the way it structures my thoughts and not taking but I also want to use it to curate content in a digital garden. I’m not sure I want all my notes out there in public and there is additional content I want to include in the Digital Garden that wouldn’t reside in this 2nd brain.\nPart of me thinks that they should almost be 2 sperate things and I just need a simple workflow where I want to ‘plant’ something in the garden - but that takes extra effort and thought… and the joy of this tool is that it maintains itself just though use. Lowering the bar to maintenance.\nI also have a current hosting package that I’m happy with which easily installs WordPress but any other framework/toolset would take a lot of config.\nSo I’m going to do a bit of digging into Digital Gardens and common toolsets.\nOne lesson I need to learn…until it finally sinks into my think skull is to back-up files!\nMessing around with WordPress I managed to delete the old media folder - 87 files gone!\nChecked my old PC’s and the backups only run until 2017 - at which point I must have thought I’d become immune to foolishness!\nLuckily I have the written content and most of the photos are simple google links - but still!Idiot\nGod\nPrayer List\nExercise\nPush-ups:: 0\nFree squats:: 0\nComputer\nSlowly losing the plot with Ionos and the changes to the hosting account.\nI’m tempted to just bin everything and start again…but but but too many variables.\nRecover what I can, and go from there.\nThink I’ve got posting to WP working from Obsidian.\nTV\nLincoln Lawyer - finished season 3.\nAlong with Bosch it’s making want to read some  Michael Connelly.\nAnyway I’ve added all those series to my Great Series List.\nFood\nTea:: 4\nMorning\n\n1 slice Toast\n\nLunch\n\nPoridge with honey\nMixed nuts, 30g\nhalf a cheese sandwich\n\nAfternoon\nDinner\n\nFresh Pasta and 2 sausages\n\nEvening\n\nBowl of Crunchy Nut\n\nLife\n\nTags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/2024/November/22nd-Nov-2024":{"title":"22nd Nov 2024","links":["Links--and--Lists/Task-List","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nLocation:: Templeton → Newport(?)\nTask List\nAfter a good bit of research I’ve decided to structure my Garden across a couple of hosting options:\n\nWordpress (Ionos) for the main structure and storing things\nGithub Pages for hosting my notes\n\nThe wordpress side of things is fairly straight forward, although I do need to get used to the new interface.\nThe Github pages intergration will take a bit of research.\nEssentially I want to:\n\nkeep my notes locally in Obsidian - backed up to github and replicated across devices\nUse Hugo to take elements of that content and convert it to clean HTML\nUse Quartz to take the HTML content and do the nice static page thing\nUse Github pages to host the notes\n\nStarting at the top, the obsidian bit is here and working - check.\nNext installing Hugo… instructions\nHugo requires:\n\nGit - already installed\nGo - straight forward .msi file [download here]\nTested the install by restarting the terminal and running ‘go version’\nDart Sass - instructions here. basically installed through choco\n\nFinally Hugo, installed through another choco command (choco install hugo-extended)\nCheck the install with:\n‘hugo version’\nAdditionally we need Rust - install instructions and exe download here.\nCheck install with:\nrustc —version\nNext clone:\n\nQuartz\nObsidian-Export running ‘cargo install obsidian-export’\nObsidian-Hugo\n\nQuartz set up\nFollowing here\ncd quartz\nnpm i\nnpx quartz create\nSo this ran with a few questions - picking the default.\nIt created a ‘content’ folder in quartz with an index.md file.\nTo test the build and view the files locally, i ran:\nnpx quartz build --serve\nThen navigated to localhost:8080 - and got a Quartz page :)\nNext swap the Quarts repo for new:\n\nlist all the repositories that are tracked\ngit remote -v\nif the origin doesn’t match your own repository, set your repository as the origin\ngit remote set-url origin github.com/galiquis/galiquis.github.io\nKeep the upstream url as github.com/jackyzha0/quartz.git\n\n…now it was at this point I started to get a little lost and looking at the stack of components it didn’t feel right. So I did a little research and found this helpful article\nGod\nPrayer List\nExercise\nPush-ups::\nFree squats::\nComputer\nTV\nFood\nLife 123\n\nTags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes"},"Daily-notes/24th-Nov-2024":{"title":"24th Nov 2024","links":["Links--and--Lists/BIG-Decision-List","Links--and--Lists/Task-List","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nLocation::\nBIG Decision List\nTask List\nGod\nPrayer List\nExercise\nPush-ups::\nFree squats::\nComputer\nTV\nFood\nLife\n\ntitle: Daily Notes - 24th Nov 2024\ndraft: false\ntags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes\n"},"Links--and--Lists/BIG-Decision-List":{"title":"BIG Decision List","links":["Themes/Lists"],"tags":[],"content":"not done\ntags include #49Goals\n\nTags:\nThemes: Lists"},"Links--and--Lists/Book-List":{"title":"Book List","links":["Themes/Lists"],"tags":[],"content":"General list of books that have been recommended.\nFiction\nReligious\n\nPerspectives on religious experience - William James 1902\nPaul Washer (Religious author)\n\nJordan Peterson’s List\n\nBeyle, Marie-Henri (Stendhal): The Charterhouse of Parma\nBronte, Emily: Wuthering Heights\nBulgakov, Mikhail: The Master and Margarita\nCary, Joyce: The Horse’s Mouth\nChandler, Raymond: The Big Sleep\nChandler, Raymond: The Long Goodbye\nDalyrmple, Theodore: Our Culture: What’s Left of It\nDalrymple, Theodore: Life at the Bottom: The Worldview That Makes the Underclass\nDostoevesky, Fyodor: Crime and Punishment\nDostoevesky, Fyodor: Notes from Underground\nDostoevesky, Fyodor: The Brothers Karamazov\nDostoevsky, Fyodor: The Devils\nDostoevsky, Fyodor: The Idiot\nGolding, William: Lord of the Flies\nGraves, Robert: I, Claudius\nHammet, Dashiel: The Maltese Falcon\nHemingway, Ernest: A Farewell To Arms\nHemingway, Ernest: For Whom the Bell Tolls\nHemingway, Ernest: The Old Man and the Sea\nHuxley, Aldous: Brave New World\nHuxley, Aldous: Island\nHuxley, Aldous: Point Counterpoint\nKazantzakis, Nikos: The Fratricides\nKazantzakis, Nikos: Zorba the Greek\nKesey, Ken: One Flew Over the Cuckoo’s Nest\nKesey, Ken: Sometimes a Great Notion\nKeyes, Daniel: Flowers for Algernon\nLaurence, Margaret: The Stone Angel\nLee, Harper: To Kill a Mockingbird\nNietzsche, Friedrich: Beyond Good and Evil\nNietzsche, Friedrich: On the Genealogy of Morals\nNietzsche, Friedrich: The Antichrist\nNietzsche, Friedrich: The Gay Science\nNietzsche, Friedrich: The Will to Power\nOrwell, George: 1984\nOrwell, George: Animal Farm\nOrwell, George: Road to Wigan Pier\nPirsig, Robert: Zen and the Art of Motorcycle Maintenance\nShem, Samuel: The House of God\nSolzhenitsyn, Aleksandr: Cancer Ward\nSolzhenitsyn, Aleksandr: The First Circle\nSolzhenitsyn, Aleksandr: The Gulag Archipelago: Vol. 1; Vol. 2; Vol. 3. (alternatively, all three volumes abridged into one)\nSteinbeck, John: East of Eden\nSteinbeck, John: The Grapes of Wrath\nSteinbeck, John: Of Men and Mice\nStendhal: The Red and the Black\nThompson, Hunter S: Fear and Loathing in Las Vegas\nTolstoy, Leo: Anna Karenina\nTolstoy, Leo: War and Peace\nTroyat, Henri: Tolstoy\nWolfe, Tom: The Electric Kool Aid Acid Test\n\nClinical Psychology and Psychiatry\n\nBecker, Ernest: The Denial of Death\nEllenberger, Henri: The Discovery of the Unconscious\nEysenck, Hans: Genius\nFrankl, Viktor: Man’s Search for Meaning\nFreud, Sigmund: An Outline of Psychoanalysis\nFreud, Sigmund: The Interpretation of Dreams\nJung, Carl: Aion\nJung, Carl: Answer to Job\nJung, Carl: Archetypes of the Collective Unconscious\nJung, Carl: Modern Man in Search of a Soul\nJung, Carl: Mysterium Coniunctionis (Difficult; read the last half)\nJung, Carl: Psychology and Alchemy\nJung, Carl: Psychology: East and West\nJung, Carl: Psychology of Religion: East and West\nJung, Carl: Symbols of Transformation\nJung, Carl: The Symbolic Life\nJung, Carl: Two Essays on Analytical Psychology\nMay, Rollo. Angel, Ernest &amp; Ellenberger, Henri: Existence: A new dimension in psychiatry and psychology\nNeumann, Erich: The Origins and History of Consciousness\nNeumann, Erich: The Great Mother\nPiaget, Jean: Play, Dreams and Imitation in Childhood\nPiaget, Jean: The Moral Judgment of the Child\nRogers, Carl: A Way of Being\nRogers, Carl: On Becoming a Person\n\nNeuroscience\n\nGibson, James J: An Ecological Approach to Visual Perception\nGoldberg, Elkhonon: The New Executive Brain\nGray, Jeffrey and Neil McNaughton: The Neuropsychology of Anxiety\nLeDoux, Joseph: The Emotional Brain\nPanksepp, Jaak: Affective Neuroscience\nSacks, Oliver: The Man who Mistook his Wife for a Hat\nSacks, Oliver: Awakenings\nSacks, Oliver: An Anthropologist on Mars\nSwanson, Larry: Brain Architecture: Understanding the Basic Plan\n\nReligion and Religious History\n\nBurton Russell, Jeffrey: Mephistopheles: The Devil in the Modern World\nEliade, Mircea: A History of Religious Ideas (Vol. 1, Vol. 2, Vol. 3)\nEliade, Mircea: Myth and Reality\nEliade, Mircea: Myths, Dreams and Mysteries\nEliade, Mircea: Shamanism: Archaic Techniques of Ecstasy\nEliade, Mircea: The Forge and the Crucible\nEliade, Mircea: The Sacred and the Profane\nFrye, Northrop: The Great Code\nFrye, Northrop: Words with Power\nLewis, Bernard: The Crisis of Islam\nSmith, Huston: (introductory): The World’s Religions\nThe Bible: Designed to be Read as Living Literature\n\nHistory/Systems Analysis\n\nde Solla Price, Derek J: Little Science, Big Science\nDe Soto, Hernando: The Mystery of Capital: Why Capitalism Triumphs in the West and Fails Everywhere Else\nGall, John: Systemantics: How Systems Work and Especially How They Fail\nPorter, Theodore M: The Rise of Statistical Thinking 1820-1900\nRadzinsky, Edvard: Stalin: The First In-depth Biography Based on Explosive New Documents from Russia’s Secret Archives\nShirer, William L: The Rise and Fall of the Third Reich\n\nThe State of the World: A 21st Century Update\n\nDeaton, Angus: The Great Escape\nLomborg, Bjorn: How to Spend $75 Billion to Make the World a Better Place\nNorberg, Johan: Progress: Ten Reasons to Look Forward to the Future\nPinker, Steven: Enlightenment Now: The Case for Reason, Science, Humanism, and Progress\nRidley, Matt: The Rational Optimist: How Prosperity Evolves\nRosling, Hans: Factfulness: Ten Reasons We’re Wrong About the World–and Why Things Are Better Than You Think\nGrinspoon, David: Earth in Human Hands\n\nMy Books\n\nPeterson, Jordan B: 12 Rules for Life: An Antidote to Chaos\nPeterson, Jordan B: Maps of Meaning\nPeterson, Jordan B: Beyond Order: 12 More Rules for Life\n\n\nTags:\r\nThemes: Lists"},"Links--and--Lists/Film-List":{"title":"Film List","links":["Themes/Lists"],"tags":[],"content":"To Watch\nWatched\n\nTags:\nThemes: Lists"},"Links--and--Lists/Great-Series-List":{"title":"Great Series List","links":[],"tags":[],"content":"Greatly recommended\n\nSupernatural\nBattlestar Galactica\nSopranos\nReacher\nDexter\nSons of Anarchy\nBosch\nBosch Legacy\nLincoln Lawyer\n"},"Links--and--Lists/Podcast-List":{"title":"Podcast List","links":["Themes/Lists"],"tags":[],"content":"Current listening\nCulture &amp; Current Affairs\n\nPowerfulJRE\nJoe Rogan’s podcast, featuring conversations with experts across disciplines, including science, culture, and politics.\nTriggernometry\nOpen discussions on controversial topics, blending humour and intellectual exploration.\n\nPolitics\n\nThe Rest Is Politics US\nA US-focused podcast featuring Katty Kay and Anthony Scaramucci, offering insights into American politics and society.\nThe News Agents\nUK-based podcast lifting the curtain on global stories with Emily Maitlis, Jon Sopel, and Lewis Goodall.\nThe Rest Is Politics\nA political podcast with Alastair Campbell and Rory Stewart discussing UK and global politics with civility and insider knowledge.\nPoliticsJOE\nEngaging and often humorous commentary on British politics, covering current events and interviews with key figures.\n\nEconomics\n\nThe Rest Is Money\nExplores economics, business, and finance with Steph McGovern and Robert Peston, making these topics relatable for everyone.\nEconomics Explained\nBreaks down global economic concepts and news, making them digestible for a wide audience.\nThe Prof G Show (Scott Galloway)\nTech, business, and AI insights from NYU professor and entrepreneur Scott Galloway, delivered with bold predictions and advice.\n\nGaming\n\nSkill Up\nDetailed video game reviews, industry commentary, and updates on the gaming world.\nBiteMe Games\nTutorials and insights into game development, particularly using Unity and other engines.\nLegendary Drops\nA channel focused on gaming, offering reviews, commentary, and tips for enthusiasts.\n\nWarframe\n\nPlayWarframe\nOfficial channel for Warframe, featuring updates, trailers, and community highlights.\nBrozime\nWarframe guides and gameplay videos, with occasional coverage of other games.\nKnightmareFrame\nCovers a mix of Warframe content and other gaming-related topics.\nTactical Potato\nWarframe-focused channel with guides and commentary, presented with humour.\nThePrimeTime\nGaming-focused channel featuring highlights from streams and gameplay sessions.\n\n\nRugby &amp; Sports\n\nEgg Chasers Rugby\nA fun and irreverent take on rugby, covering grassroots to international games.\nThe Rugby Pod\nRugby news, stories, and banter from hosts including Andy Goode and Jim Hamilton.\nRugbyPass\nA comprehensive resource for rugby fans, featuring highlights, analysis, and streaming options.\n\n\nScience &amp; Learning\n\nVeritasium\nExplores science, education, and curiosity, with engaging visual explanations of complex ideas.\n3Blue1Brown\nVisual mathematics tutorials that simplify challenging topics through creative animation.\nScott Manley\nVideos about space, science, and rocketry, offering accessible explanations for space enthusiasts.\nDr Geoff Lindsey\nExplores speech, language, and accents with an academic yet approachable perspective.\n\n\nFitness &amp; Health\n\nATHLEAN-X™\nFitness and training advice to help viewers build strength and improve athleticism.\nDaily Dose Of Wisdom\nFaith-based channel addressing cultural questions and offering insights into Christianity.\n\n\nLifestyle &amp; Outdoors\n\nOff Grid Irish Homestead\nChronicles life on a remote Irish homestead, including renovations and off-grid living.\nPaul Messner\nOutdoor adventures, camping tips, and gear reviews with a touch of personality.\nMyLifeOutdoors\nFocuses on backpacking, gear reviews, and hiking adventures, offering practical insights for outdoor enthusiasts.\n\n\nPhilosophy &amp; Personal Development\n\nAlex O’Connor (Cosmic Skeptic)\nTackles philosophical and religious topics with critical thinking and debate.\nChris Williamson\nFocuses on self-improvement, understanding life, and interviews with leading thinkers.\n\n\nProgramming &amp; Technology\n\nThePrimeagen\nVideos about programming, tech, and gaming, focusing on developer tools like Vim.\nJeff Su\nPractical career and productivity tips, especially useful for young professionals.\nTheKengineer\nTutorials and tips for gamers and developers, with a focus on Warframe.\nsentdex\nPython tutorials for machine learning, data analysis, and software development.\nAdam Finer - Learn BI Online\nSimplifies business intelligence concepts, helping beginners learn data analysis and visualisation.\n\n\nMusic &amp; Arts\n\nPaul Davids\nGuitar tutorials, tips, and creative insights for musicians of all levels.\nLindybeige\nEclectic content on historical warfare, dance, and more, with an entertaining narrative style.\n\nRecommendations\n\nBen Parsons - Dark Net Diaries\n\nDip in\n\nJordan Peterson\nPresidents Daily Brief\n\nNo more\n\nTags:\nThemes: Lists"},"Links--and--Lists/Task-List":{"title":"Task List","links":["Themes/Lists"],"tags":[],"content":"Just a list of actions to keep track of things I need to do:-\nOpen\nnot done\ntags do not include #49Goals\nCompletion List\ndone\nTesting - ignore\nnot done\ntags include #test\n\nTags:\nThemes: Lists"},"Links--and--Lists/Things-I-like-to-do":{"title":"Things I like to do","links":[],"tags":[],"content":"\nComputer games\n\nGTA\nElder Scrolls\nFallout\nD&amp;D\n\n\nWalks…beaches, forests and mountains\nCreativity &amp; being productive\nCoding\n\ngenerative art\n\n\nMusic\n"},"Links--and--Lists/Unlinked-files":{"title":"Unlinked files","links":[],"tags":[],"content":"list from [[]] and !outgoing([[]])\nTASK\nWHERE !completed\nLIMIT 10\nGROUP BY file.link\nSORT rows.file.ctime ASC"},"Links--and--Lists/Useful-Links-and-Sites":{"title":"Useful Links and Sites","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAreaTitleDescriptionLinkLinuxOSBoxesOSBoxes offers ready-to-use Linux based virtual machines, eliminating the need for complex setup procedures. Download an image and go.https://www.osboxes.org/AIChatGPThttps://chatgpt.com/MarkdownCheat SheetGeneral cheat sheet for Markdownwww.markdownguide.org/cheat-sheet/MarkdownBasic SyntaxThe easy stuffwww.markdownguide.org/basic-syntaxMarkdownExtended SyntaxThe more advanced stuffwww.markdownguide.org/extended-syntax/MarkdownHacksThe good stuffwww.markdownguide.org/hacks/"},"Main-Notes/Cheat-Sheets/ChatGPT":{"title":"ChatGPT","links":[],"tags":[],"content":"Placeholder for common prompts and the like."},"Main-Notes/Cheat-Sheets/NeoVim":{"title":"NeoVim","links":[],"tags":[],"content":"Simple place for me to store the nvim shortcuts I always forget."},"Main-Notes/Church/My-Testimony":{"title":"My Testimony","links":[],"tags":[],"content":"How I came to believe (short version)\nFor me I spent a long time learning and finding out more about Jesus without really having much faith, it then kind of grew and crept up on me.\nThere’s head knowledge and heart knowledge - I’d spent a lot of time learning and not really engaging with my heart.\nBut that changed…\nPartly due to thinking about these things more… contemplating the sacrifice Christ made for us all and what it meant. Understanding the inherent beauty in the message of the Gospel.\nPartly due to meeting more people that were like me - and that had a strong faith (Naomi)\nPartly taking more responsibility for myself and how I walked in the world.\nBut then came a test…and I think all real faith has gone through a test.\nI won’t go into the details - maybe one day I will.\nSuffice it to say that on a cold and stormy Saturday night I hit rock bottom and reached out in faith and He was there to help me…to pick me up…to comfort me and put my feet where they needed to tread."},"Main-Notes/Church/My-Theology-Notes/If-Jesus-Was-a-Jew,-How-Does-His-Message-Speak-to-Everyone":{"title":"If Jesus Was a Jew, How Does His Message Speak to Everyone","links":["tags/Jesus","tags/Faith","tags/Inclusivity","tags/AlphaCourse","tags/BibleStudy","tags/CanaaniteWoman","tags/SamaritanWoman","tags/RomanCenturion","Themes/MyTheology"],"tags":["Jesus","Faith","Inclusivity","AlphaCourse","BibleStudy","CanaaniteWoman","SamaritanWoman","RomanCenturion"],"content":"Steph’s Question\nSteph raised a thought-provoking question during her Alpha course:\n“If Jesus was a Jew, how does His message have relevance for us?”\nThis led me to explore how Jesus’ ministry, while rooted in Jewish tradition, expanded to include all people.\n\nJesus’ Mission to the Jews\nJesus Himself acknowledged that His mission began with the Jewish people, referring to them as the “lost sheep of Israel” (Matthew 15:24). He was born into Jewish culture, fulfilled Jewish prophecy, and often directed His teachings to Jewish audiences. However, this initial focus doesn’t mean His mission was exclusive.\n\nMoments of Inclusivity in Jesus’ Ministry\n\n\nThe Canaanite Woman\nIn Matthew 15:21-28, a Canaanite woman begged Jesus to heal her daughter. At first, Jesus seemed reluctant, saying, “It is not right to take the children’s bread and toss it to the dogs” (Matthew 15:26). Her reply, “Even the dogs eat the crumbs that fall from their master’s table” (Matthew 15:27), revealed her persistent faith. Jesus responded, “Woman, you have great faith! Your request is granted” (Matthew 15:28). This showed that faith, not ethnicity, opened the door to His blessings.\n\n\nThe Roman Centurion\nIn Matthew 8:5-13, a Roman centurion asked Jesus to heal his servant. Jesus marvelled at his faith, saying, “Truly I tell you, I have not found anyone in Israel with such great faith” (Matthew 8:10). He then declared, “Many will come from the east and the west, and will take their places at the feast with Abraham, Isaac, and Jacob in the kingdom of heaven” (Matthew 8:11), signalling a mission that welcomed all nations.\n\n\nThe Samaritan Woman\nIn John 4:7-26, Jesus spoke with a Samaritan woman at a well—a bold act that broke Jewish cultural norms. He revealed Himself to her as the Messiah (John 4:26) and spoke of “living water” (John 4:10), symbolising salvation for all people, even those outside the Jewish community.\n\n\n\nFaith as the Key\nThese moments highlight a crucial truth: Jesus’ mission wasn’t limited by ethnicity or cultural boundaries. Faith became the defining factor for belonging to God’s kingdom. As Paul later wrote, “There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus” (Galatians 3:28).\n\nRelevance for Us Today\nJesus’ teachings transcend time and culture because they speak to the human condition—our need for grace, purpose, and connection with God. While His ministry started within the framework of Jewish tradition, it was always meant to extend globally. His message of faith, forgiveness, and salvation remains as relevant today as it was then.\n\nTags:JesusFaithInclusivityAlphaCourseBibleStudyCanaaniteWomanSamaritanWomanRomanCenturion\nThemes: MyTheology\nReferences:\n\nMatthew 15:21-28 – The Canaanite woman’s faith.\nMatthew 8:5-13 – The Roman centurion’s faith.\nJohn 4:7-26 – Jesus and the Samaritan woman.\nGalatians 3:28 – Paul’s teaching on unity in Christ.\n"},"Main-Notes/Church/Non-religious-quotes":{"title":"Non-religious quotes","links":[],"tags":[],"content":"\n“The fact that mathematics does such a good job of describing the Universe is a mystery that we don’t understand. And a debt that we will probably never be able to repay.” - Lord Kelvin, 1897\n\n\nOne of the most beautiful qualities of true friendship is to understand and to be understood.\nLucius Annaeus Seneca\n\n\n“We suffer more often in imagination than in reality”\nLucius Annaeus Seneca\n"},"Main-Notes/Church/Prayer-List":{"title":"Prayer List","links":[],"tags":[],"content":"Finding Jesus\n\nCristyn, Ross &amp; girls\nLee\nWill\nChris\n\nOthers\n\nHannah\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAreaPersonPrayerNotesAddedRemovedIllnessKen SharpeHealing for his leukemiaComing up to a year since his diagnosis and his health is ok. The treatment is keeping him active and relatively healthy.December 2023IllnessDadHealing for his Parkinsons10 year into his diagnosis. Mobility is impaired, he’s hard to understand as he’s very quiet, he had a fall last month (Oct-24). Also he has2022IllnessChristine SharpeHealing for her dementiaSince her stroke she’s developed vascular dementia.2023IllnessAunty HillaryHealing for her dementia2023IllnessHoward StoneHealing for his heart condition.Healing for his relationship with Sarah2023IllnessLee RellishHealing for his blood pressureLee’s been having episodes of feeling faint and dizzy which they think is related to his blood pressure.November 2024Following JesusIsaacThat Isaac keeps on his Journey of faith in Jesus and takes the steps to know him and love him.Isaac is on the cusp of real belief I think. But like me I think he will need time to work through all the noise modern life throws out.November 2024Following JesusSamThat Sam finds his faith again and has that personal relationship with Jesus.Sometimes it feels like me and Sam travel in opposite directions. As a boy he had a strong independent faith and used to take himself off to church. I pray he finds that again.November 2024"},"Main-Notes/Exercise/Mixed-set":{"title":"Mixed set","links":["tags/Exercise"],"tags":["Exercise"],"content":"Row 10 mins\n3 x 10 Chest press - 40kg\n2 x 10 sit ups\n2(2) x 5 Lat pull down (swap grip) - 42kg\n3 x 10 leg raises\n3 x 7 Shoulder press DB - 15kg\n2 x 10 side dips - 7.5kg\n3 x 6 Shoulder raises DB - 6kg\n2 x free Squats\n2 x 10 Bent over row DB - 15kg\n3 x 7 Bicep curl DB - 6kg\n2 x 10 Straight arm raise &amp; dip - 10kg\n2 x 10 tricept dips - 13kg\nExercise"},"Main-Notes/Exercise/Templeton-Home-Set":{"title":"Templeton Home Set","links":[],"tags":[],"content":"Daily Exercise Routine\nWarm-Up (2–3 mins)\n\n\nArm Circles – 30 seconds (15 seconds forward, 15 seconds back)\n\nStand tall, extend arms out to your sides, and make small circles.\nWarms up shoulders and increases joint mobility.\n\n\n\nBodyweight Squats – 10 slow and controlled reps\n\nStand with feet shoulder-width apart, lower hips as if sitting in a chair, and return to standing.\nEngages your legs, glutes, and core.\n\n\n\nHigh Knees/Marching in Place – 1 minute\n\nLift knees high toward your chest while alternating legs.\nBoosts heart rate and preps lower body muscles.\n\n\n\nHip Circles – 30 seconds (15 seconds each direction)\n\nPlace hands on hips, rotate hips in a circular motion.\nLoosens hips and reduces stiffness.\n\n\n\n\nStrength and Conditioning (15 mins)\nPerform 2–3 rounds of the following circuit. Rest for 1–2 minutes between rounds.\nA. Lower Body\n\n\nBodyweight/Goblet Squats – 10–15 reps\n\nHold a kettlebell at your chest (if using one), squat down, and stand back up.\nStrengthens quads, hamstrings, glutes, and core.\n\n\n\nKettlebell Deadlifts – 10–12 reps\n\nWith the kettlebell on the ground, hinge at your hips to grab it, stand tall, and lower it back.\nTargets hamstrings, glutes, and lower back.\n\n\n\nResistance Band Lateral Walks – 10 steps each direction\n\nWith the band around your thighs, squat slightly and take steps sideways.\nActivates glutes and hip stabilisers.\n\n\n\n\nB. Upper Body\n\n\nPush-Ups – 10–20 reps\n\nLower your chest to the ground with hands shoulder-width apart and push back up.\nBuilds chest, shoulders, triceps, and core strength.\n\n\n\nKettlebell Rows – 8–10 reps per arm\n\nBend at the hips, hold the kettlebell in one hand, and pull it toward your waist.\nStrengthens back muscles and arms.\n\n\n\nResistance Band Pull-Aparts – 10–12 reps\n\nHold the band at chest height and stretch it apart until arms are wide.\nTargets upper back and improves posture.\n\n\n\n\nC. Core\n\n\nPlank – Hold for 20–30 seconds\n\nHold your body in a straight line, supported by your forearms and toes.\nBuilds core stability and endurance.\n\n\n\nRussian Twists – 10 twists per side\n\nSit with knees bent, twist your torso side-to-side (optionally holding a kettlebell).\nWorks obliques and rotational core strength.\n\n\n\nGlute Bridge – 12–15 reps\n\nLie on your back, push hips upward by squeezing your glutes, and lower slowly.\nStrengthens glutes, lower back, and core.\n\n\n\n\nCool Down (2–3 mins)\n\n\nCat-Cow Stretch – 30 seconds\n\nOn all fours, alternate arching your back upward and dipping it downward.\nLoosens the spine and relieves tension.\n\n\n\nHip Flexor Stretch – 30 seconds per side\n\nKneel on one leg, lean slightly forward to stretch the front of the hip.\nOpens tight hips and improves mobility.\n\n\n\nHamstring Stretch – 30 seconds per side\n\nSit with one leg extended, reach for your toes, and hold.\nStretches hamstrings and lower back.\n\n\n\nChild’s Pose – 30 seconds\n\nKneel, sit back on your heels, and stretch your arms forward on the ground.\nRelaxes the back and hips.\n\n\n"},"Main-Notes/Info":{"title":"Info","links":[],"tags":[],"content":"House purchases\n\n182 Brynglass Road - 23rd July 2004 to 10th September 2021\n82 Allt-Yr-Yn View - 14 September 2012\n20 Potters Grove - 1st October 2021\n\nCar\nMini\nReg: GD15VTT\nTire Pressure:\n\nFront - 37.7 psi\nBack - 34. 8 psi\n\n"},"Main-Notes/Isaac/1.-Rules/Rule-1---Have-Faith":{"title":"Rule 1, have faith.","links":["Main-Notes/Church/My-Testimony"],"tags":[],"content":"Faith is such an important thing to have in life - it guides, protects and comforts.\nIf nothing else, know that there is something bigger and better than the day to day grind helps get you through the day to day grind.\nBut it’s both simple and complex, so here are some thoughts on why faith is important to me and my rule number 1.\nWhy is it important\nThe first thing that comes to mind is that it’s the key to the next stage…if you don’t believe you don’t get to experience the real boundaries of existence.\nWhat comes next, we don’t really know…but if you don’t believe you don’t have the chance to find out. Now , I always feel that is a bit of a cop-out. Like a logical insurance scheme…and of-course why faith is important runs far deeper.\n\nFaith is important as an act of ongoing gratitude from which worship flows\nThere’s no true equality without God\nThere’s no better foundation for how to live your life or make the right choices\nWhen life gets hard having faith is a comfort - because there are better things to come\nI think it gives you a mental toughness against some of the bad things that can happen in life\n\nHow I came to believe (short version)\nI’ve written a little bit of my journey in faith - My Testimony\nFaith is simple.\nAt its core, Christianity is incredibly straightforward: love God and love others.\nAs Jesus said in Matthew 22:37-39:\n37 And Jesus replied to him, “‘You shall love the Lord your God with all your heart, and with all your soul, and with all your mind.’ 38 This is the first and greatest commandment. 39 The second is like it, ‘You shall love your neighbour as yourself (that is, unselfishly seek the best or higher good for others).’\nIf you think of all the abundance we enjoy on a daily basis, especially compared to a lot of others it’s truly staggering and completely undeserved. That’s Grace, gifts that we don’t deserve. It comes from His love of us and in return he just asks us to love him, and each other.\nPowerfully simple, and the prize - eternal life\nJohn 3:16\n“For God so (greatly) loved and dearly prized the world, that He (even) gave His (One and) only begotten Son, so that whoever believes and trusts in Him (as Saviour) shall not perish, but have eternal life.\nAlso John 11:25-26\n“I am the resurrection and the life. The one who believes in me will live, even though they die; and whoever lives by believing in me will never die. Do you believe this?”\nJesus speaks to the promise of eternal life, offering reassurance that faith in Him brings life beyond physical death. His question at the end—“Do you believe this?”—is a personal invitation to trust in His power over life and death.\nFrom this simple choice comes a whole world of complexity…\nFaith begins with an open invitation, like a free pass to a circus, only to find that following Jesus means stepping onto a high wire.  It’s simple enough to say “yes” with a willing heart, but then that “yes” takes us places we never expected.\nMaybe that’s the paradox of faith: the initial act of trust is simple, but its journey demands everything from us, uncovering a courage we didn’t know we had. As we inch forward, we discover that Jesus isn’t just at the other end of the wire—He’s right there, helping us balance, catching us when we fall, helping us back on the wire.\nFaith gives identity and purpose\nHaving faith means knowing that God understands me intimately and that my life is part of a greater design. This belief gives my life purpose, turning even small actions into meaningful contributions to a bigger story. Without faith, life might feel random, but with it, every choice finds deeper significance.\nFaith, for me, is like an inner compass, guiding me toward lasting values—see some of the other Rules!—and helping me stay grounded, especially in uncertain times. It’s less about following rules and more about nurturing a meaningful relationship with God and those around me.\nFaith also connects me with a community of like-minded people. When we moved to West Wales, finding a new church was my first priority, which soon became a network of friends and support in a place where we’d known no one. These relationships go deeper than friendship, giving me encouragement and a sense of family wherever I am. There’s a network of support among Christians worldwide, reminding me that I’m never truly alone.\nMy identity through faith isn’t tied to possessions or status but anchored in God’s love. It’s a foundation that doesn’t shift with trends or accomplishments, offering stability that endures through life’s changes.\nFinally, faith calls me to serve others, following Jesus’ example. It’s not just about personal growth but about making a difference. Whether through small acts of kindness or greater commitments, faith leads me to live with open hands and a compassionate heart, creating a fulfilling and purposeful life.\nFaith is a Source of Hope and Resilience\nFaith is not only the key to eternal life; it’s also a kind of superpower when life throws challenges your way. Countless times, I’ve faced tough situations and leaned on Him for help—like when you were born and things became complicated, or when your mum had her follow-up health issues, or as I’ve walked with my dad through Parkinson’s Disease. In these testing times, prayer becomes a lifeline. Putting my worries into His hands doesn’t erase them, but it lightens the load, giving me strength and peace.\nFaith brings a unique resilience too. Disappointments and setbacks feel different when you trust they’re part of a bigger plan. Knowing “it wasn’t meant to be” helps me move forward without carrying the same weight of frustration or regret. And that underlying hope—that if it’s not working out, it’s simply not the end yet—brings a powerful comfort. Faith truly is a kind of superpower, offering both hope and strength when they’re needed most.\nFaith Grows Over Time\nGo read My Testimony, and you’ll see that my journey with faith has been anything but straightforward. For a long time, I was firmly in the atheist camp, confident that science held the answers to everything, with any remaining mysteries simply waiting for science to catch up. But over time, things didn’t quite add up, and there was a recurring presence in my life of people with faith. In difficult moments, I found myself praying, and often those prayers were answered in ways I couldn’t ignore. As I looked back, I could see a thread of Jesus running through my life, quietly there, waiting.\nFaith grows like a seed—it starts small, sometimes barely noticeable, but over time it pushes its roots deeper, finding strength and grounding in ways we don’t always see right away. My own journey took years, full of questions, doubts, and times I was sure I didn’t believe at all. But God has this way of planting people and moments in your life that gently guide you back to Him. Even in my moments of doubt, I see now that He was there, patient and constant, helping me along.\nFor many, faith isn’t a sudden flash or an instant conversion. It’s a journey, one that unfolds over time. I’ve known many who found faith later in life, and even for me, it wasn’t until you were born that I truly understood unconditional love—an experience that deepened my appreciation of His love for us. Faith isn’t about rushing to answers or feeling pressured to believe everything all at once. It’s okay if your path to faith is gradual, and it’s okay to have questions along the way. God meets us wherever we are, often in unexpected ways, and He has a plan for each of us. So don’t feel rushed; everything happens at the right time.\nFaith often doesn’t make logical sense\nA lot of people don’t have faith and enjoy debating with those who do—I know, because I used to be one of them. I enjoy these discussions from the other side now because I understand that, yes, much of faith really does defy logic. After all, you can’t see God or prove His existence, and there are plenty of things faith asks of us that go against conventional wisdom.\nHow can we forgive others, even when forgiveness isn’t deserved? What about the idea of loving your enemies—something that defies human instinct? Faith often takes traditional ideas of strength and success and turns them upside down. As Scripture says, “when I am weak, then I am strong” (2 Corinthians 12:10), reminding us that real strength isn’t about self-sufficiency but about relying on something greater.\nFaith invites us to hope when circumstances suggest otherwise, to give freely with no expectation of return, and to trust that there’s meaning in suffering, even when we can’t understand it in the moment. It calls us to live generously, forgive completely, and love beyond reason. And throughout history, we see how these choices to live by faith have yielded profound results.\nCorrie ten Boom, for instance, survived the horrors of a concentration camp in Nazi Germany, yet she chose to forgive even her enemies. After the war, when confronted by one of the guards from the camp who had been cruel to her and her sister, Corrie chose forgiveness over hatred. She credited her faith for giving her the strength to forgive, and her choice to forgive inspired countless others to do the same, proving that love can heal even the deepest wounds.\nEven Emperor Julian, known as Julian the Pagan, couldn’t help but acknowledge the compassion of Christians. Though he tried to suppress Christianity, he admitted that Christians cared for their own poor and those outside their community. Their acts of charity and service stood in stark contrast to the values of the time, showing that faith-driven compassion is a powerful force for change.\nMartin Luther King Jr. also illustrated how faith can transform not only individuals but entire communities. In his famous sermon “Loving Your Enemies,” King drew from Jesus’ teachings to encourage love over hatred, even for those who sought to harm him. He reminded people that, “hate multiplies hate, violence multiplies violence,” and only love can break this cycle. King’s commitment to nonviolence in the face of brutality showed that faith-based love is not weak but a radical force for justice and peace.\nIn many ways, faith operates outside the bounds of logic, asking us to believe, love, and give beyond what makes sense. But these examples show how, when we take that leap, faith leads to unexpected peace, resilience, and a sense of purpose. It’s a choice to believe in something deeper, trusting that there’s more to life than what we can see or prove. And in these powerful examples, we see that faith’s “illogical” actions—loving enemies, forgiving the unforgivable, showing compassion to all—are what bring about true healing and transformation."},"Main-Notes/Isaac/1.-Rules/Rule-10---Discipline--and--Prudence":{"title":"Rule 10 - Discipline & Prudence","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-11---Faireness-(Justice--and--Charity)":{"title":"Rule 11 - Faireness (Justice & Charity)","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-12---Fortitude-(Courage--and--Patience)":{"title":"Rule 12 - Fortitude (Courage & Patience)","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-13---Hope":{"title":"Rule 13 - Hope","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-14---Be-a-rebel":{"title":"Rule 14 - Be a rebel","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-3---Work-hard":{"title":"Rule 3 - Work hard","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-4---Strive...always":{"title":"Rule 4 - Strive...always","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-5---Forgiveness":{"title":"Rule 5 - Forgiveness","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-6---Gratefulness":{"title":"Rule 6 - Gratefulness","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-7---Humility":{"title":"Rule 7 - Humility","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-8---Hospitality":{"title":"Rule 8 - Hospitality","links":[],"tags":[],"content":""},"Main-Notes/Isaac/1.-Rules/Rule-9---Moderation":{"title":"Rule 9 - Moderation","links":[],"tags":[],"content":""},"Main-Notes/Isaac/2.-Poems--and--Quotes/Desiderata":{"title":"Desiderata","links":["tags/poem","tags/desiderata","tags/lifelessons","tags/Ready","Themes/Isaac"],"tags":["poem","desiderata","lifelessons","Ready"],"content":"by Max Ehrmann (1927)\nGo placidly amid the noise and the haste, and remember what peace there may be in silence. As far as possible, without surrender, be on good terms with all persons.\nSpeak your truth quietly and clearly; and listen to others, even to the dull and the ignorant; they too have their story.\nAvoid loud and aggressive persons; they are vexatious to the spirit. If you compare yourself with others, you may become vain or bitter, for always there will be greater and lesser persons than yourself.\nEnjoy your achievements as well as your plans. Keep interested in your own career, however humble; it is a real possession in the changing fortunes of time.\nExercise caution in your business affairs, for the world is full of trickery. But let this not blind you to what virtue there is; many persons strive for high ideals, and everywhere life is full of heroism.\nBe yourself. Especially do not feign affection. Neither be cynical about love; for in the face of all aridity and disenchantment, it is as perennial as the grass.\nTake kindly the counsel of the years, gracefully surrendering the things of youth.\nNurture strength of spirit to shield you in sudden misfortune. But do not distress yourself with dark imaginings. Many fears are born of fatigue and loneliness.\nBeyond a wholesome discipline, be gentle with yourself. You are a child of the universe no less than the trees and the stars; you have a right to be here.\nAnd whether or not it is clear to you, no doubt the universe is unfolding as it should. Therefore be at peace with God, whatever you conceive Him to be. And whatever your labours and aspirations, in the noisy confusion of life, keep peace in your soul. With all its sham, drudgery and broken dreams, it is still a beautiful world. Be cheerful. Strive to be happy.\n\nTags:poemdesideratalifelessons\nStatus:Ready\nThemes: Isaac"},"Main-Notes/Isaac/2.-Poems--and--Quotes/Do-not-go-gentle-into-that-good-night":{"title":"Do not go gentle into that good night","links":["tags/poem","tags/dylanthomas","tags/lifelessons","tags/Ready","Themes/Isaac"],"tags":["poem","dylanthomas","lifelessons","Ready"],"content":"By DYLAN THOMAS\nDo not go gentle into that good night,\nOld age should burn and rave at close of day;\nRage, rage against the dying of the light.\nThough wise men at their end know dark is right,\nBecause their words had forked no lightning they\nDo not go gentle into that good night.\nGood men, the last wave by, crying how bright\nTheir frail deeds might have danced in a green bay,\nRage, rage against the dying of the light.\nWild men who caught and sang the sun in flight,\nAnd learn, too late, they grieved it on its way,\nDo not go gentle into that good night.\nGrave men, near death, who see with blinding sight\nBlind eyes could blaze like meteors and be gay,\nRage, rage against the dying of the light.\nAnd you, my father, there on the sad height,\nCurse, bless, me now with your fierce tears, I pray.\nDo not go gentle into that good night.\nRage, rage against the dying of the light.\n\nTags:poemdylanthomaslifelessons\nStatus:Ready\nThemes: Isaac"},"Main-Notes/Isaac/2.-Poems--and--Quotes/If":{"title":"If","links":["tags/poem","tags/lifelessons","tags/Ready","Themes/Isaac"],"tags":["poem","lifelessons","Ready"],"content":"BY RUDYARD KIPLING\nIf you can keep your head when all about you\nAre losing theirs and blaming it on you,\nIf you can trust yourself when all men doubt you,\nBut make allowance for their doubting too;\nIf you can wait and not be tired by waiting,\nOr being lied about, don’t deal in lies,\nOr being hated, don’t give way to hating,\nAnd yet don’t look too good, nor talk too wise:\nIf you can dream—and not make dreams your master;\nIf you can think—and not make thoughts your aim;\nIf you can meet with Triumph and Disaster\nAnd treat those two impostors just the same;\nIf you can bear to hear the truth you’ve spoken\nTwisted by knaves to make a trap for fools,\nOr watch the things you gave your life to, broken,\nAnd stoop and build ’em up with worn-out tools:\nIf you can make one heap of all your winnings\nAnd risk it on one turn of pitch-and-toss,\nAnd lose, and start again at your beginnings\nAnd never breathe a word about your loss;\nIf you can force your heart and nerve and sinew\nTo serve your turn long after they are gone,\nAnd so hold on when there is nothing in you\nExcept the Will which says to them: ‘Hold on!’\nIf you can talk with crowds and keep your virtue,\nOr walk with Kings—nor lose the common touch,\nIf neither foes nor loving friends can hurt you,\nIf all men count with you, but none too much;\nIf you can fill the unforgiving minute\nWith sixty seconds’ worth of distance run,\nYours is the Earth and everything that’s in it,\nAnd—which is more—you’ll be a Man, my son!\n\nTags:poemlifelessons\nStatus:Ready\nThemes: Isaac"},"Main-Notes/Isaac/2.-Poems--and--Quotes/Invictus":{"title":"Invictus","links":["tags/poem","tags/lifelessons","tags/Ready","Themes/Isaac"],"tags":["poem","lifelessons","Ready"],"content":"BY WILLIAM ERNEST HENLEY\nOut of the night that covers me,\nBlack as the pit from pole to pole,\nI thank whatever gods may be\nFor my unconquerable soul.\nIn the fell clutch of circumstance\nI have not winced nor cried aloud.\nUnder the bludgeonings of chance\nMy head is bloody, but unbowed.\nBeyond this place of wrath and tears\nLooms but the Horror of the shade,\nAnd yet the menace of the years\nFinds and shall find me unafraid.\nIt matters not how strait the gate,\nHow charged with punishments the scroll,\nI am the master of my fate,\nI am the captain of my soul.\n\nTags:poemlifelessons\nStatus:Ready\nThemes: Isaac"},"Main-Notes/Isaac/Dad,-I-want-to-hear-your-story/1.-It's-your-birthday":{"title":"1. It's your birthday","links":[],"tags":[],"content":"What is your birthday?\n18th November 1975\nWhat was your name at birth?\nGareth Richard McNamee\nWere you named after a relative or someone else of significance?\nDon’t think so, Gareth was a popular name at the time due to Welsh Rugby and Gareth Edwards (great player). Not sure where Richard came from, certainly wasn’t from my Grandfathers.\nWhat city were you born in?\nChililabombwe, Zambia\nWhat was your height and weight at birth?\nWere you born in a hospital?\nYes - Konkola Mine Hospital I think"},"Main-Notes/Isaac/Start-Here":{"title":"Start Here","links":["tags/Ready","Themes/Isaac"],"tags":["Ready"],"content":"Evening,\nIt struck me a while ago that much of what I try to teach you is probably too soon (you’re only 10), not fully thought out (I make a lot of it up as I go along) and not put across in a way that you engage with.\nSo I thought I’d start writing some of it down, giving it some structure and having it live here in my Journal - in case you need to read it one day.\nMaybe you won’t read this - but it’s a good exercise for me to write down what’s important for me in life, the things I have learnt and have helped me along the way.\nI do hope that you do find it one day.\nI’ll add topics and ideas as I go. I can’t promise it will make a lot of sense or even be worth the read - but hopefully it gives you and insight into me your Dad.\nAlways proud of you my boy…always proud!\nDad\nForward, always forward!\n\nTags:\nStatus:Ready\nThemes: Isaac"},"Main-Notes/Python/angle_between.py":{"title":"angle_between.py","links":[],"tags":[],"content":"import numpy as np\ndef angle_between(pos1, pos2):\r\npos2 = ((pos2[0] - pos1[0]), (pos2[1] - pos1[1]))\r\npos1 = (0, 0)\r\nang1 = np.arctan2(*pos1[::-1])\r\nang2 = np.arctan2(*pos2[::-1])\r\nangle = (ang2 - ang1) % (2 * np.pi)\r\nreturn angle\nangle_1 = angle_between((0, 0), (10, 10))\r\nangle_2 = angle_between((10, 10), (0, 0))\nprint(np.degrees(angle_1))\r\nprint(np.degrees(angle_2))"},"Main-Notes/Python/interpolate_angle.py":{"title":"interpolate_angle.py","links":[],"tags":[],"content":"def interpolate_angle(ang1, ang2, percentage=0):\r\na1 = 0\r\na2 = (ang2 - ang1) % (2 * pi)\npercentage = int(round(percentage, 5) * 100)\r\nif a2 &lt; pi:\r\n    range = np.linspace(a1, a2, 101)\r\nelse:\r\n    range = np.linspace(a2, (2 * pi), 101)\r\n    range = range[::-1]  # reverse order\r\nnew_angle = (range[percentage] + ang1) % (2 * pi)  # #\r\nif (pi + 0.01) &lt;= a2 &lt;= (pi - 0.01):\r\n    new_angle = ang1\r\nreturn new_angle\n"},"README":{"title":"README","links":["tags/Raw","tags/Rough","tags/Reviewed","tags/Refined","tags/Ready"],"tags":["Raw","Rough","Reviewed","Refined","Ready"],"content":"Journal\nI started this 2022 and didn’t keep it going for long.\nIt’s now 2024 - let’s try again!\nNotes on mechanics\nStatuses\nRaw →Rough →Reviewed →Refined →Ready"},"Source-Notes/Atomic-Habits---Key-Insights":{"title":"Atomic Habits - Key Insights","links":["Themes/Small-Changes,-Big-Impact","Themes/Focus-on-Identity-over-Goals","Themes/Environment-Design"],"tags":[],"content":"Introduction\nJames Clear’s Atomic Habits explores how small, consistent changes—atomic habits—can compound over time to produce remarkable results. This book offers a framework for understanding habit formation and practical strategies for cultivating positive habits and breaking negative ones.\nThe Power Of Tiny Gains\nSmall Changes, Big Impact\n\nClear argues that 1% improvements each day can lead to a significant transformation over time.\nSuccess isn’t about massive shifts but about refining everyday actions.\n\nKey Idea: Focus on gradual improvement rather than immediate results.\nThe Habit Loop\nThe Four-Step Habit Loop Clear breaks down habits into four stages:\n\nCue – Triggers your brain to initiate a behaviour.\nCraving – Motivates you to act.\nResponse – The habit itself.\nReward – Satisfies your craving and reinforces the behaviour.\n\nKey Idea: Understand each part of the habit loop to effectively modify behaviour.\nThe Four Laws Of Behaviour Change\nThe Four Laws of Behaviour Change Clear introduces a framework for habit formation, which he calls the “Four Laws of Behaviour Change.” Each law aligns with one step in the habit loop:\nMake It Obvious (#Cue)\n\nDesign your environment to highlight cues for positive habits.\nUse habit stacking (linking a new habit to an existing one) to reinforce cues.\n\nMake It Attractive (#Craving)\n\nPair behaviours with positive experiences to make habits more appealing.\nImplement temptation bundling—combine a habit you need to do with one you enjoy.\n\nMake It Easy (#Response)\n\nReduce friction by simplifying the steps to start a habit.\nApply the two-minute rule: scale habits down to a version that takes two minutes or less.\n\nMake It Satisfying (#Reward)\n\nCreate immediate rewards to encourage repetition.\nTrack progress and celebrate small wins to reinforce positive behaviour.\n\nKey Idea: Aligning these laws can make it easier to form new habits and eliminate unhelpful ones.\nIdentity And Belief\nFocus on Identity over Goals\n\nClear emphasises that the most sustainable habits stem from identity-based changes rather than outcome-based changes.\nShift from “I want to get fit” (outcome) to “I am someone who enjoys physical activity” (identity).\n\nKey Idea: Align your habits with the person you wish to become, not just the goals you want to achieve.\nHabit Tracking And Measurement\nHabit Tracking and Accountability\n\nHabit tracking helps keep you consistent and motivated by providing visible evidence of progress.\nThe “don’t break the chain” method encourages consistency.\nFind an accountability partner to increase motivation and commitment.\n\nKey Idea: Make progress visible to reinforce your efforts.\nEnvironment Design\nEnvironment Design\n\nShape your environment to support good habits and make bad habits less accessible.\nFor example, place healthy snacks in an easily accessible spot or keep distractions like your phone out of reach when focusing.\n\nKey Idea: Environment often matters more than motivation; set yourself up for success by creating a supportive space.\nBreaking Bad Habits\nBreaking Bad Habits Clear suggests inverting the Four Laws of Behaviour Change to disrupt unwanted habits:\n\nMake It Invisible (#Cue)\n\nReduce exposure to cues that trigger unwanted habits.\n\n\nMake It Unattractive (#Craving)\n\nReframe negative habits in a way that makes them undesirable.\n\n\nMake It Difficult (#Response)\n\nIncrease the effort required to engage in bad habits.\n\n\nMake It Unsatisfying (#Reward)\n\n\nIntroduce consequences or accountability to reduce the satisfaction of engaging in the habit.\n\nKey Idea: Modify your environment and responses to make it harder to fall into negative patterns.\nConclusion\nClear’s approach is grounded in the idea that we don’t rise to the level of our goals; we fall to the level of our systems. Small habits, whether positive or negative, can shape our identity and compound over time.\nFinal Thought: Atomic Habits advocates for patience, self-compassion, and a long-term perspective in personal growth. Focusing on tiny, consistent changes can transform your life profoundly over time."},"Source-Notes/Iain-M-Banks/Consider-Phlebas---Iain-M-Banks":{"title":"Consider Phlebas - Iain M Banks","links":["Themes/Existentialist-Philosophy","Themes/Artificial-Intelligence","Themes/Post-Humanist-Ethics","Themes/Utopian-Literature","Themes/Dystopian-Themes-in-Science-Fiction"],"tags":[],"content":"Summary\nConsider Phlebas is the first book in Banks’ Culture series, introducing readers to a sprawling, intergalactic conflict between two advanced civilizations: the Culture, a hyper-advanced, utopian society run by AIs and theocratic species, and the Idirans, a species who see themselves as holy warriors fighting to preserve their empire and faith. The story follows Bora Horza Gobuchul, a shape-shifting mercenary allied with the Idirans, on a mission to retrieve a powerful Culture AI stranded on a distant planet. Horza’s journey is full of morally complex encounters, battles, and intense philosophical dilemmas as he moves through various locales and interacts with characters who embody different ideals and beliefs.\nKey Themes\n\n\nWar and Moral Ambiguity: Banks delves into the complexity of war, challenging simple binaries of good versus evil. While the Culture’s motives seem altruistic, Banks leaves room for doubt, questioning if peace and freedom can be achieved through aggressive expansion or control. The Idirans’ religious fervour contrasts sharply with the Culture’s utilitarian ethics, creating tension around concepts of purpose, autonomy, and identity.\n\n\nIdentity and Individualism: Horza’s shape-shifting ability symbolizes the fluidity of identity, and his shifting loyalties reflect a struggle to find meaning. This theme resonates with questions about how much we’re shaped by society and how much we’re free to pursue our own path. Horza’s role as an outsider (fighting against the Culture but not truly an Idiran) brings isolation and introspection.\n\n\nArtificial Intelligence and Post-Humanism: The Culture is largely controlled by superintelligent AIs (called Minds), raising questions about the role of AI in society and the future of human agency. This is particularly relevant as the novel explores whether humanity (or sentient life) can thrive in a society managed by AIs or if there’s a loss of purpose and identity.\n\n\nReligion versus Secularism: The Idirans represent a deeply religious worldview, while the Culture operates under secular, rationalist principles. This contrast serves as a broader exploration of whether religious belief or secularism is more compatible with progress and peace.\n\n\nConnections to Broader Ideas\n\n\nEthical Relativism in Conflict: Horza’s journey echoes the “ends justify the means” debate seen in historical and political contexts. It raises questions about how much compromise we can accept in our ethical frameworks and what we’re willing to sacrifice in the name of a cause. This connects to many discussions on real-world conflicts where opposing sides have justified morally ambiguous actions.\n\n\nPhilosophical Questions on AI and Utopian Societies: The Culture challenges traditional ideas of government and societal organization by proposing an AI-driven, post-scarcity utopia, an idea resonant in today’s AI and automation discourse. Are humans (or sentient beings) happier in a society without material want? This theme links to philosophical discussions on freedom, autonomy, and happiness in a post-work world.\n\n\nHumanism and Existentialism: Horza’s struggle to find purpose and belonging reflects existentialist questions around meaning and self-actualization. Banks’ portrayal of an individual trapped between opposing ideologies speaks to the tension between humanism’s emphasis on individual experience and existentialist notions of self-determination.\n\n\nUseful Connections in Obsidian\n\nLink to Existentialist Philosophy notes, especially the works of Camus and Sartre on identity and freedom.\nConnect with Artificial Intelligence and Post-Humanist Ethics for themes of AI’s role in society.\nTie in with themes of Utopian Literature or Dystopian Themes in Science Fiction, exploring contrasts with authors like Ursula K. Le Guin (The Dispossessed) or Aldous Huxley (Brave New World).\nConsider a cross-reference with Religious Conflict and Secularism, discussing the ethical and philosophical bases for each stance and real-world parallels.\n"},"Source-Notes/Iain-M-Banks/Excession---Iain-M-Banks":{"title":"Excession - Iain M Banks","links":[],"tags":[],"content":"Summary\nExcession is one of the most ambitious novels in Banks’ Culture series, focusing primarily on the Culture’s AI Minds and their complex interactions. The story is driven by the arrival of a mysterious and immensely powerful alien artifact called the Excession, which surpasses the technological capabilities of even the Culture’s advanced technology. This “Outside Context Problem” (OCP) poses a profound enigma, and different factions within the Culture’s Minds—particularly within Contact and the enigmatic Special Circumstances division—begin to vie over how to approach and, if possible, control the Excession. Meanwhile, characters like Byr Genar-Hofoen, a human ambassador with a complicated romantic history, and the militaristic Affront species, add layers of personal and political intrigue to the overarching plot.\nThe novel delves into the consciousness, autonomy, and ethical motivations of the Minds, exploring what happens when even a utopian society faces a crisis beyond its control.\nKey Themes\n\n\nThe Nature of Godlike AI and Consciousness: Excession gives readers an in-depth look at the Culture’s Minds, highly intelligent AIs whose capabilities are so far beyond humans that they border on divine. Banks explores how these Minds navigate their own identities, ambitions, and even existential dilemmas, raising questions about sentience, agency, and the ethical responsibility of godlike beings.\n\n\nPower, Control, and Ethical Relativism: The Excession itself becomes a focal point for power struggles among the Minds, revealing that even the Culture’s seemingly idealistic society is not immune to conflict and ambition. The intrigue around the Excession prompts readers to question the ethics of controlling immense power and how utopian ideals might falter when real-world complexities intervene.\n\n\nOutside Context Problem (OCP): The concept of the OCP is central to the novel, representing an unprecedented challenge so alien that it defies normal understanding. This theme resonates as a metaphor for any crisis that reshapes assumptions about the world, such as technological revolutions or paradigm shifts, urging societies (and individuals) to confront their limits and adaptability.\n\n\nHumanity in the Face of Immensity: The novel juxtaposes the vast, abstract struggles of the Minds with the more personal, emotional conflicts of human characters. This contrast explores how humans deal with forces beyond their control and understanding, reflecting the theme of human agency and vulnerability in an unfathomably complex universe.\n\n\nPolitical and Ethical Manipulation: The Affront, an aggressively hierarchical and militaristic species, acts as a foil to the Culture’s ethical ideals, offering a contrasting worldview that values dominance and cruelty. The Culture’s interactions with the Affront reveal the Culture’s own biases and provoke reflection on the ethics of interventionism.\n\n\nConnections to Broader Ideas\n\n\nPhilosophy of Artificial Intelligence and Consciousness: The depth with which Banks explores the Minds’ inner lives opens up fascinating discussions on AI consciousness and the moral responsibilities of advanced intelligence. This could link to contemporary questions about AI alignment, moral autonomy, and whether AI could develop its own ethical framework separate from human oversight.\n\n\nParadigm Shifts and Existential Threats: The Excession as an OCP serves as a metaphor for existential threats, such as climate change or potential alien encounters, where humanity’s understanding and response mechanisms are insufficient. This ties into themes from speculative and philosophical literature about humanity’s adaptability and resilience in the face of unprecedented challenges.\n\n\nThe Limits of Utopian Ideals: Through the Minds’ politicking and occasional power plays, Banks critiques the Culture’s utopian image, showing that even the most idealistic societies are not immune to ambition and conflict. This can be linked to discussions of ethical relativism, as the Culture’s handling of power contrasts with its purported values of peace and autonomy.\n\n\nEthical Dilemmas of Interventionism: The Affront’s inclusion as a foil to the Culture raises questions about when, or if, it is ethical to intervene in another society’s internal affairs. This resonates with real-world debates on humanitarian interventions and the potential for moral hypocrisy in powerful nations’ actions on the global stage.\n\n\nTranscendence and the Limits of Human Understanding: The Excession itself, as an object that transcends even the Minds’ comprehension, represents the theme of unknowable forces or beings, resonating with existential questions around human purpose in an infinite universe. This aligns with broader philosophical inquiries about humanity’s role and meaning in a universe filled with forces beyond our understanding.\n\n\nUseful Connections in Obsidian\n1. AI Consciousness and Ethical Responsibility\n\nTopics: AI autonomy, advanced intelligence, moral agency, and the philosophical implications of “godlike” beings.\nConnections:\n\nLink to discussions on Philosophy of Artificial Intelligence, especially the ethical responsibilities of sentient AIs.\nInclude references to Post-Humanism and the implications of AI surpassing human moral and intellectual boundaries.\nCross-reference with Moral Philosophy for questions around autonomy, free will, and the obligations of beings with immense power.\n\n\n\n2. Existential Challenges and Paradigm Shifts\n\nTopics: Unprecedented existential threats (Outside Context Problems), societal resilience, adaptability in the face of the unknown.\nConnections:\n\nLink to Existential Threats (e.g., climate change, technological singularity) and the philosophical and psychological impacts of facing forces beyond control.\nAdd a section on Humanity’s Limits and Adaptability for a broader exploration of how societies adapt to game-changing challenges.\nReference Speculative Literature on Existential Risks to examine how Banks and other authors explore societies’ responses to crises that defy existing paradigms.\n\n\n\n3. Utopian Ideals and Ethical Complexity\n\nTopics: The Culture’s utopian framework, ethical relativism, the tension between idealism and pragmatism.\nConnections:\n\nLink to Utopian and Dystopian Ideals for reflections on how idealistic societies grapple with internal flaws and moral ambiguities.\nConnect with Ethics of Power and Control, examining how utopian or well-intentioned systems handle real-world complexity.\nCross-reference with Philosophy of Governance to question if true moral purity is achievable within any governing structure or ideology.\n\n\n\n4. Ethical Interventionism and Cultural Sovereignty\n\nTopics: The ethics of intervening in other societies, Culture vs. Affront as a critique of interventionism.\nConnections:\n\nLink to Political Philosophy and Ethical Interventionism, exploring when, if ever, it is ethical for one society to interfere in the workings of another.\nAdd a section on Colonialism and Sovereignty to discuss historical and modern perspectives on intervention, control, and moral relativism.\nCross-reference with Comparative Cultural Ethics to examine different frameworks of ethical action in diverse societies.\n\n\n\n5. Transcendence, the Sublime, and the Limits of Understanding\n\nTopics: Encountering the unknowable (the Excession), human insignificance, philosophical transcendence.\nConnections:\n\nLink to Existentialism and the Sublime for themes exploring humanity’s place in an unfathomably complex and vast universe.\nCross-reference with Philosophy of the Unknowable and Transcendence, touching on questions about the boundaries of human and AI understanding.\nInclude connections to Cosmic Horror and Literary Transcendence to delve into how other genres treat encounters with the incomprehensible or sublime.\n\n\n"},"Source-Notes/Iain-M-Banks/The-Player-of-Games---Iain-M-Banks":{"title":"The Player of Games - Iain M Banks","links":["Themes/Game-Theory","Themes/Social-Structures","Themes/Existentialist-Philosophy","Themes/Utopian-Literature","Themes/Capitalism-and-Class-Struggle","Themes/Moral-Philosophy"],"tags":[],"content":"Summary\nThe Player of Games is the second novel in Banks’ Culture series, and it explores themes of competition, power, and morality through the story of Jernau Morat Gurgeh, a master player in the Culture. Gurgeh, though brilliant at games, finds himself discontented with the lack of purpose in the Culture’s hedonistic, post-scarcity society. He is recruited by the Culture’s Contact division to participate in a complex and high-stakes game on the distant planet of Azad, where the game serves as a metaphor for the entire hierarchical and oppressive structure of the alien Empire of Azad. Gurgeh’s journey through the game forces him to confront the nature of competition, the depths of human (and alien) cruelty, and his own identity within the Culture.\nKey Themes\n\n\nCompetition and Power Dynamics: In the Empire of Azad, the titular game is not merely a pastime but an institution that dictates social hierarchy, politics, and even reproduction. This hierarchy contrasts sharply with the Culture’s egalitarian values, and through Gurgeh’s interactions with the game and the Empire, Banks critiques societies built on inequality, questioning the legitimacy of systems that reward ambition at the cost of empathy.\n\n\nIdentity and Purpose in a Post-Scarcity World: Gurgeh’s dissatisfaction in the Culture highlights the potential for ennui or existential crises in a utopian society. He yearns for a challenge, suggesting that struggle and competition may be inherent to a meaningful life. This theme resonates with the notion that self-actualization can be difficult to achieve in a world without personal stakes or societal challenges.\n\n\nMorality and Corruption: The Empire of Azad exemplifies a corrupt, brutal society that uses the game as a means to justify inequality and oppression. Through Gurgeh’s eyes, readers are invited to reflect on the dangers of systemic corruption and the ethical responsibility to challenge such structures. This theme also highlights the differences between ethical frameworks, contrasting the Culture’s idealism with the Empire’s utilitarian cruelty.\n\n\nHuman vs. Alien Ideologies: The Culture’s ethos of freedom, equality, and lack of coercive power contrasts with the rigid, hierarchical ideology of the Empire. Gurgeh’s immersion in the game offers a perspective on the limits of human empathy and understanding, exploring whether radically different societies can coexist or if one must inevitably dominate the other.\n\n\nConnections to Broader Ideas\n\n\nThe Nature of Games as Societal Microcosms: The Empire of Azad’s reliance on the game as a metaphor for social, political, and economic power is reminiscent of sociological theories that view social structures as competitive games. It also connects to cultural critiques of sports, finance, and politics, where “playing the game” often becomes a euphemism for navigating complex power dynamics. This theme could link to ideas around social hierarchies, competition, and theories like game theory itself.\n\n\nPhilosophical Ideas on Purpose and Happiness: Gurgeh’s search for meaning in a society without deprivation is a thoughtful exploration of human purpose and the potential downsides of a utopian world. It connects to philosophical debates on whether happiness is possible without personal challenges, echoing ideas from existentialist philosophers like Nietzsche or even Aristotle’s concept of eudaimonia (flourishing).\n\n\nMoral Relativism vs. Absolutism: The stark moral differences between the Culture and the Empire bring up questions about moral relativism: is there a “right” way to structure society, or are all forms inherently flawed? This could also link to real-world discussions on cultural relativism, ethical imperialism, and the risks of ideological conformity within complex societies.\n\n\nCritique of Capitalism and Hierarchies: The Empire’s values could be seen as a critique of modern capitalist societies, where hierarchies often mirror oppressive structures found in autocracies or oligarchies. Banks raises questions about whether power structures inherently become corrupt, offering readers a chance to question parallels in their own societies.\n\n\nUseful Connections in Obsidian\n\nLink to Game Theory and Social Structures notes, exploring how games reflect and reinforce societal power dynamics.\nConnect with Existentialist Philosophy and Utopian Literature, drawing comparisons with works like Brave New World or The Dispossessed by Ursula K. Le Guin.\nCross-reference with Capitalism and Class Struggle, considering the critiques Banks levels at rigid hierarchical systems.\nTie into Moral Philosophy discussions, specifically around the challenges of moral relativism and the search for absolute values in human (or alien) societies.\n"},"Source-Notes/Iain-M-Banks/Use-of-Weapons---Iain-M-Banks":{"title":"Use of Weapons - Iain M Banks","links":["Themes/Moral-Philosophy","Themes/Autonomy-vs.-Instrumentalisation","Themes/War-Literature","Themes/Ethics-of-Warfare","Themes/Redemption-Arcs-in-Literature"],"tags":[],"content":"Summary\nUse of Weapons is one of the darker entries in the Culture series, following the story of Cheradenine Zakalwe, a skilled mercenary often employed by the Culture’s Contact division to influence foreign worlds toward their ideals. The narrative alternates between two timelines: Zakalwe’s current mission, in which he is tasked with retrieving a powerful politician, and fragmented flashbacks that slowly reveal his traumatic past and personal motivations. The novel’s structure gradually unveils the devastating costs of his actions, exploring themes of identity, trauma, and the ethical complexities of warfare.\nThe novel is well-known for its intricate structure and shocking twist ending, which reframes much of Zakalwe’s actions and motivations, forcing readers to reconsider their understanding of him and the nature of heroism and guilt.\nKey Themes\n\n\nWar and Ethical Ambiguity: Use of Weapons dives into the grey areas of morality in wartime, questioning whether noble ends can justify violent means. Zakalwe’s missions for the Culture often involve morally questionable acts, challenging the reader to consider if ethical sacrifices are acceptable in the pursuit of a greater good. The Culture’s use of Zakalwe as a “weapon” mirrors its own sometimes manipulative, hands-off approach to war.\n\n\nTrauma and Identity: Zakalwe is haunted by his past, and his identity is constantly fractured by traumatic memories. The structure of the novel, with disjointed memories interwoven with present events, reflects this fragmentation, inviting readers to explore how deeply trauma shapes us and whether we can escape it or ever fully reconcile with it.\n\n\nInstrumentalisation of Individuals: The Culture’s treatment of Zakalwe as a tool raises questions about autonomy and exploitation. Zakalwe’s agency is compromised by his need to serve, but he is not fully part of the Culture either, existing in a liminal space between self-determination and manipulation. This theme highlights the tension between individual will and institutional power.\n\n\nRedemption and Forgiveness: Zakalwe’s journey is one of painful self-reflection, though he’s often unwilling to confront his guilt. The novel challenges the reader to think about whether redemption is possible for those who have committed acts of violence, and what it means to forgive oneself or be forgiven by others. It’s a deeply human exploration of reconciliation and regret.\n\n\nConnections to Broader Ideas\n\n\nThe Psychological Costs of War: Zakalwe’s experiences mirror the psychological tolls seen in many real-life combat veterans, offering a lens into PTSD and the struggle to reintegrate into “normal” life after warfare. His story connects to discussions on the ethics of sending individuals to fight on behalf of ideological causes and the long-term impacts of this decision on mental health.\n\n\nHuman as Weapon and Autonomy: The novel raises questions about autonomy, particularly when people are turned into instruments of political or military power. This can link to philosophical discussions on free will and determinism, as well as modern debates on AI ethics and the use of automation in warfare—particularly whether tools designed for combat can ever truly serve a humanitarian purpose.\n\n\nMemory and Self-Perception: The fragmented narrative invites an exploration of memory’s role in shaping identity. Zakalwe’s attempts to bury his past connect with psychological theories on trauma, repression, and the ways we reconstruct our personal histories. This can be linked to works like Slaughterhouse-Five by Kurt Vonnegut or Beloved by Toni Morrison, where memory’s power is central.\n\n\nRedemption and Guilt: Zakalwe’s struggle with guilt and the possibility of redemption connects to existentialist ideas on personal responsibility and atonement. His journey can be seen as a search for meaning in the wake of moral transgressions, resonating with classic literary explorations of guilt, such as in Dostoevsky’s Crime and Punishment.\n\n\nEthical Interventionism: The Culture’s use of agents like Zakalwe as “weapons” raises questions about interventionism and the morality of imposing ideals on other societies, linking to real-world debates on humanitarian interventions and the ethical complexity of influencing foreign nations for perceived higher causes.\n\n\nUseful Connections in Obsidian\n\nLink to PTSD and Trauma Studies for an exploration of psychological resilience, trauma, and memory.\nConnect with Moral Philosophy notes, especially sections on guilt, redemption, and existentialist themes around forgiveness.\nCross-reference with Autonomy vs. Instrumentalisation to delve into ethical discussions about using individuals as tools, touching on parallels in AI ethics and the military-industrial complex.\nTie into War Literature and the Ethics of Warfare, including connections to classic anti-war novels and texts that examine the human cost of conflict.\nAdd to a broader section on Redemption Arcs in Literature, connecting with stories that explore atonement and the impact of guilt.\n"},"Source-Notes/Theology/Blaise-Pascal":{"title":"Blaise Pascal","links":["tags/BlaisePascal","tags/Mathematics","tags/Physics","tags/ProbabilityTheory","tags/Theology","tags/FaithAndReason","tags/Christianity","tags/PascalWager","tags/Pensées","tags/Philosophy","tags/ScienceAndReligion","tags/HumanCondition","tags/Spirituality","tags/HistoricalFigures","tags/Legacy","tags/Rough","Faith-and-Reason","Evidence-and-Belief","Science-and-Spirituality"],"tags":["BlaisePascal","Mathematics","Physics","ProbabilityTheory","Theology","FaithAndReason","Christianity","PascalWager","Pensées","Philosophy","ScienceAndReligion","HumanCondition","Spirituality","HistoricalFigures","Legacy","Rough"],"content":"Blaise Pascal: A Brief Overview with Quotes on Religion\nBlaise Pascal (1623–1662) was a French mathematician, physicist, inventor, writer, and philosopher, renowned for his contributions to science, mathematics, and theology. His work profoundly influenced both intellectual and spiritual thought, bridging the worlds of reason and faith.\n\nScientific and Mathematical Achievements\n\nMathematics:\n\nContributed to probability theory, foundational to modern statistics and risk analysis.\nWorked on geometry and projective geometry, significantly advancing the field.\nDeveloped Pascal’s Triangle, a mathematical tool for binomial coefficients.\n\n\nPhysics:\n\nPioneered experiments on fluids and atmospheric pressure, demonstrating the existence of a vacuum.\nDefined Pascal’s law, which explains the principles of fluid pressure.\nThe SI unit of pressure, the “pascal” (Pa), is named in his honour.\n\n\nInventions:\n\nInvented the Pascaline, one of the first mechanical calculators, to assist his father’s work as a tax collector.\n\n\n\n\nReligious Philosophy and Writings\nAfter a profound religious experience in 1654, Pascal turned his focus to theology and philosophy, producing some of the most influential Christian writings of his time.\r\nThe Pensées:\n\nHis most famous work, Pensées (“Thoughts”), is a collection of fragments intended for a defence of the Christian faith.\nIntroduced Pascal’s Wager, arguing it is rational to believe in God:\r\n“If you gain, you gain all; if you lose, you lose nothing. Wager, then, without hesitation that He exists.”\nGod providing evidence of his existence:\r\n“There is enough light for those who desire only to see, and enough darkness for those of a contrary disposition.”\r\nThis reflects Pascal’s view that God provides sufficient evidence of His existence for those who seek Him with an open heart, but not so much that belief becomes unavoidable for those who choose doubt or disbelief. Faith, in Pascal’s view, involves a balance between evidence and the willingness to trust beyond what is fully seen.\n\nQuotes on Religion:\n\nOn Faith and Reason:\n“The heart has its reasons which reason knows nothing of. We know the truth not only by the reason but by the heart.”\nOn the Search for God:\n“There is a God-shaped vacuum in the heart of each man, which cannot be satisfied by any created thing, but only by God, the Creator, made known through Jesus Christ.”\nOn the Human Condition:\r\n“Man’s greatness lies in his ability to know his wretchedness. A tree does not know its wretchedness.”\n\nReflections on Christianity:\nPascal wrestled with the paradoxes of faith, the limits of human understanding, and humanity’s yearning for God. His work emphasizes the interplay of doubt and belief, showcasing the depth of Christian spirituality.\n\nLegacy\nBlaise Pascal’s life and work exemplify the harmony between reason and faith. His scientific contributions advanced humanity’s understanding of the physical world, while his theological reflections provided profound insights into the spiritual condition. His ability to articulate the human longing for God and the interplay of reason and belief continues to inspire thinkers and believers alike.\n\nTags: -BlaisePascalMathematicsPhysicsProbabilityTheoryTheologyFaithAndReasonChristianityPascalWagerPenséesPhilosophyScienceAndReligionHumanConditionSpiritualityHistoricalFiguresLegacy`\r\nStatus::Rough\r\nThemes: Faith and Reason, Evidence and Belief,  Science and Spirituality\r\nReferences:"},"Source-Notes/Theology/Scientific-Evidence/Attending-religious-services-linked-to-longer-lives,-study-shows":{"title":"Attending religious services linked to longer lives, study shows","links":["tags/ReligiousServices","tags/Longevity","tags/WomensHealth","tags/Epidemiology","tags/PublicHealth","tags/SocialSupport","tags/MentalHealth","tags/LifestyleFactors","tags/HarvardTHChan","tags/NursesHealthStudy","tags/Reviewed"],"tags":["ReligiousServices","Longevity","WomensHealth","Epidemiology","PublicHealth","SocialSupport","MentalHealth","LifestyleFactors","HarvardTHChan","NursesHealthStudy","Reviewed"],"content":"\nTitle: Attending religious services linked to longer lives, study shows\nDate: July 14, 2016\nAuthor: Harvard Health Publishing\nURL: www.health.harvard.edu/mind-and-mood/attending-religious-services-linked-to-longer-lives-study-shows\n\nA study from the Harvard T.H. Chan School of Public Health, published in 2016, analyzed data from the Nurses’ Health Study involving 74,534 women over 16 years. The research found that women who attended religious services more than once per week had a 33% lower risk of dying during the study period compared to those who never attended. The study also noted that regular attendees had lower rates of smoking and depression and were more likely to have strong social support.\n\nReligious Attendance and Health: A Harvard T.H. Chan School of Public Health study examined the health impacts of religious attendance among 74,534 women over 16 years using data from the Nurses’ Health Study.\nReduced Mortality Risk: Women attending religious services more than once per week had a 33% lower mortality risk compared to non-attendees. Weekly attendees had a 26% reduction, and those attending less than weekly had a 13% reduction.\nLower Rates of Smoking and Depression: Regular attendees were also found to have lower smoking rates, less depression, and stronger social support networks.\nSpirituality Beyond Attendance: Researchers noted that religious service attendance is one aspect of spirituality and suggested future studies explore other practices, like meditation, to further understand health connections.\nPublication: Findings were published on May 16, 2016, in JAMA Internal Medicine.\n\n\nTags: -ReligiousServicesLongevityWomensHealthEpidemiologyPublicHealthSocialSupportMentalHealthLifestyleFactorsHarvardTHChanNursesHealthStudy\nStatus::Reviewed"},"Source-Notes/Theology/Scientific-Evidence/Regularly-attending-religious-services-associated-with-lower-risk-of-deaths-of-despair":{"title":"Regularly attending religious services associated with lower risk of deaths of despair","links":["tags/HarvardTHChanSchool","tags/ReligiousServices","tags/DeathsOfDespair","tags/MentalHealth","tags/PublicHealth","tags/SuicidePrevention","tags/SubstanceAbuse","tags/AlcoholPoisoning","tags/Epidemiology","tags/HealthResearch","tags/Reviewed"],"tags":["HarvardTHChanSchool","ReligiousServices","DeathsOfDespair","MentalHealth","PublicHealth","SuicidePrevention","SubstanceAbuse","AlcoholPoisoning","Epidemiology","HealthResearch","Reviewed"],"content":"\nTitle: Regularly attending religious services associated with lower risk of deaths of despair\nAuthor: Harvard T.H. Chan School of Public Health\nPublication Date: May 6, 2020\nURL: www.hsph.harvard.edu/news/press-releases/regularly-attending-religious-services-associated-with-lower-risk-of-deaths-of-despair/\n\nThe Harvard T.H. Chan School of Public Health published a press release on May 6, 2020, titled “Regularly attending religious services associated with lower risk of deaths of despair.” The article discusses a study indicating that individuals who attend religious services at least once a week have a significantly lower risk of deaths related to suicide, drug overdose, and alcohol poisoning.\n\nLower Risk of Death from Despair: Harvard T.H. Chan School of Public Health research found that attending religious services at least once a week significantly reduced the risk of “deaths of despair” (suicide, drug overdose, and alcohol poisoning). This effect was stronger in women (68% lower risk) than in men (33% lower risk).\nStudy Population: The analysis included 66,492 women from the Nurses’ Health Study II and 43,141 men from the Health Professionals Follow-Up Study.\nReligion as a Protective Factor: The study suggests religious participation may provide a buffer against despair by fostering resilience, hope, and social connectedness, potentially acting as a social determinant of health.\nContext of the Findings: These findings gain relevance during the COVID-19 pandemic, highlighting the importance of community support as healthcare professionals and others face severe challenges.\nPublication and Support: Published in JAMA Psychiatry on May 6, 2020, the study received funding from the Templeton Foundation and National Institutes of Health.\n\nTags:HarvardTHChanSchoolReligiousServicesDeathsOfDespairMentalHealthPublicHealth SuicidePrevention SubstanceAbuse AlcoholPoisoning Epidemiology HealthResearch\nStatus::Reviewed"},"Source-Notes/Theology/Scientific-Evidence/Religious-upbringing-linked-to-better-health-and-well-being-during-early-adulthood":{"title":"Religious upbringing linked to better health and well-being during early adulthood","links":["tags/ReligiousUpbringing","tags/HealthAndWellBeing","tags/EarlyAdulthood","tags/MentalHealth","tags/PhysicalHealth","tags/SpiritualPractices","tags/YouthDevelopment","tags/PublicHealthResearch","tags/HarvardStudy","tags/Reviewed"],"tags":["ReligiousUpbringing","HealthAndWellBeing","EarlyAdulthood","MentalHealth","PhysicalHealth","SpiritualPractices","YouthDevelopment","PublicHealthResearch","HarvardStudy","Reviewed"],"content":"Title: Religious upbringing linked to better health and well-being during early adulthood\r\nDate: September 13, 2018\r\nAuthor: Harvard T.H. Chan School of Public Health\r\nURL: www.hsph.harvard.edu/news/press-releases/religious-upbringing-adult-health/\nThe article titled “Religious upbringing linked to better health and well-being during early adulthood” was published by the Harvard T.H. Chan School of Public Health on September 13, 2018. It discusses a study indicating that individuals who participated in spiritual practices during childhood and adolescence experienced improved health and well-being in early adulthood. The study found that regular attendance at religious services or daily prayer/meditation in youth was associated with greater life satisfaction and reduced likelihood of depressive symptoms, smoking, illicit drug use, and sexually transmitted infections in their 20s. The research was conducted by analysing data from the Nurses’ Health Study II and the Growing Up Today Study, involving over 5,000 participants followed for 8–14 years. The findings suggest that religious upbringing can positively influence health behaviours and mental health outcomes in early adulthood.\n\nChildhood Spirituality and Adult Health: Harvard T.H. Chan School of Public Health research suggests that participating in spiritual practices in youth, like weekly religious services or daily prayer/meditation, may lead to improved health and well-being outcomes in early adulthood.\nPositive Health and Social Outcomes: Young adults who attended services weekly were 18% more likely to report happiness, 29% more likely to volunteer, and 33% less likely to use illicit drugs. Those who prayed or meditated daily were 16% more likely to be happy, 30% less likely to engage in early sexual activity, and 40% less likely to have an STI.\nImplications for Parenting: The study highlights that fostering regular spiritual habits in adolescence could protect against depression, substance abuse, and risky behaviours, promoting mental health, community engagement, and life satisfaction.\nStudy Limitations: The sample was primarily white females from higher socioeconomic backgrounds, which may limit generalisability. Additionally, it didn’t factor in parental and peer influence on adolescent spirituality.\nPublication: Findings were published in the American Journal of Epidemiology on September 13, 2018.\n\n\nTags:ReligiousUpbringingHealthAndWellBeingEarlyAdulthoodMentalHealth PhysicalHealthSpiritualPractices YouthDevelopment PublicHealthResearchHarvardStudy\r\nStatus::Reviewed"},"Source-Notes/Theology/Within-Reason-Podcast---Women,-Slaves--and--the-Unforgivable-Sin":{"title":"Within Reason Podcast - Women, Slaves & the Unforgivable Sin","links":["Source-Notes/Theology/Scientific-Evidence/Attending-religious-services-linked-to-longer-lives,-study-shows","Source-Notes/Theology/Scientific-Evidence/Regularly-attending-religious-services-associated-with-lower-risk-of-deaths-of-despair","Source-Notes/Theology/Scientific-Evidence/Religious-upbringing-linked-to-better-health-and-well-being-during-early-adulthood","tags/Christianity","tags/ChristianityResearch","tags/initial"],"tags":["Christianity","ChristianityResearch","initial"],"content":"Host: Alex O’Connor\r\nGuests: Cliffe &amp; Stuart Knechtle (@givemeananswer)\r\nDate of publication:\n\nStraight into the Deep end Alex asks what is the definition of Christianity:\ntitle: Explaination of Christianity (Cliffe Knechtle)\n_That God created us to love him with all out hearts, mind, soul and strength and to love our neighbours as ourselves, at times we&#039;ve done it, at times we haven&#039;t.\nWhen we don&#039;t that is called sin and it leads to a consequence and separation from God, death and hell. But God loved us so much that he sent his only son Jesus to bleed and die on the cross to forgive us, to offer us a free gift Grace Forgiveness and Eternal Life.... and now as we put our faith in him he gives us that gift and we begin life with him now and for eternity._\nWhy are people in need of Jesus?\r\nGod shaped hole in peoples lives - more suffering through Covid, busyness, anxiety, suicide etc\r\nNeed something that has a higher calling.\r\nIs this a meaning crisis in a more secular view?\r\nNews feeds are filled with bad news.\nInteresting point that there have been studies by Harvard showing the positive benefits of going to church vs social clubs…need to find the research:\nAttending religious services linked to longer lives, study shows\nRegularly attending religious services associated with lower risk of deaths of despair\nReligious upbringing linked to better health and well-being during early adulthood\nCharles Taylor’s concept of the “buffered self” contrasts modern identity with the “porous self” of pre-modern societies. In “enchanted” societies, people experienced a porous self, with a permeable boundary between the self and the world, often attributing emotions and experiences to external forces. Modernity, however, brought the buffered self, characterized by a strong boundary separating inner life from external influences, emphasizing autonomy and self-control. Taylor’s work reflects the shift toward secularism and individualism, offering insights into the balance between personal autonomy and interconnectedness in contemporary selfhood.\nIs Christianity just a solution to the problem of existential dread?\nInteresting view on Buda and suffering being perception that can be transcended vs the Christian View.\r\nIn Buddhism, suffering is seen as an inherent part of life caused by attachment and ignorance, which can be transcended through self-awareness, compassion, and the pursuit of enlightenment. In Christianity, suffering is viewed as a consequence of sin, but it also has redemptive value, offering a path to spiritual growth and a closer relationship with God. While Buddhism emphasizes overcoming suffering through inner transformation, Christianity finds hope in faith and the promise of eternal peace with God. Both traditions view suffering as a catalyst for deeper meaning and transformation.\nNotes on Christ’s Suffering\n\nThe Suffering God:\n\nChristianity uniquely presents a God who suffers. Jesus, as God incarnate, experienced the full extent of human suffering—physical, emotional, and spiritual.\nThis suffering culminates on the cross, where Jesus endured profound physical agony and spiritual abandonment, crying out, “My God, My God, why have you forsaken me?” (Matthew 27:46).\n\n\nChrist as a Response to the Problem of Suffering:\n\nUnlike views such as Buddhism’s, which describe suffering as an illusion, Christianity acknowledges suffering as a real and painful part of existence.\nJesus’ suffering provides a framework for understanding human pain: it exists because of a broken world but will ultimately be redeemed.\nGod’s humility is displayed in Christ, who suffers alongside humanity and offers the ultimate solution—eternal life and redemption.\n\n\nLife is Unfair, but God is Fair:\n\nDrawing from the Book of Job, the unfairness of life is contrasted with God’s fairness. In Jesus, God does not remain distant but enters into the human experience of injustice and suffering, affirming His presence even in pain.\n\n\nHope Through Suffering:\n\nChrist’s suffering leads to the hope of eternal life. Revelation 21:4 promises an end to suffering, where God will wipe away every tear, erasing death, mourning, and pain.\nThis future hope reframes suffering as temporary, meaningful, and part of a greater redemptive plan.\n\n\nComfort for Humanity:\n\nJesus’ suffering offers comfort to those in pain. The Christian standing by the bed of a suffering child can draw strength from the knowledge that Christ endured suffering, bringing hope and the promise of resurrection.\nWhile the atheist might see suffering as meaningless, the Christian finds assurance that God is present in suffering and has provided a way to overcome it.\n\n\nContrast with Secular Perspectives:\n\nChristianity doesn’t dismiss suffering as random or meaningless; it acknowledges the depth of pain but places it within a narrative of restoration.\nThis stands in contrast to secular or atheist views, where suffering may lack a redemptive framework, leaving only the randomness of existence.\n\n\nJesus as a Model for Endurance:\n\nJesus’ response to suffering—trusting God’s plan and forgiving His enemies—serves as a model for believers facing their own pain.\nThe cross demonstrates both the seriousness of suffering and the profound love and humility of God in addressing it.\r\nThis perspective on Christ’s suffering underscores the Christian hope that pain, while real and often overwhelming, is not the final word. It offers a vision of redemption and meaning that transforms the experience of suffering into a pathway to eternal hope.\n\n\n\nSummary of the Scenario: The Child on the Bed\nThe discussion presents a scenario where a child lies gravely ill, suffering from a debilitating disease. Two individuals stand on either side of the bed: a Christian and an atheist. Both seek to comfort the child, but their perspectives shape how they perceive and address the suffering.\n\nThe Atheist: Views suffering as a natural, random consequence of existence, with no overarching purpose or resolution. Comfort may come from empathy and shared humanity, but there is no promise of redemption or meaning beyond the immediate moment.\nThe Christian: Sees suffering through the lens of faith, believing in a God who suffers alongside humanity and offers ultimate hope through the promise of eternal life. This provides not just comfort but a framework for meaning and redemption.\n\nKey Ideas\n\nChristian Perspective:\n\nSuffering is real and deeply painful but not meaningless.\nThe Christian worldview holds that suffering exists due to human rebellion (the Fall) but will ultimately be redeemed by God.\nChrist’s suffering and resurrection provide hope for eternal life, offering a solution to the problem of suffering.\nRevelation 21:4 encapsulates this hope: a future where there is no death, mourning, or pain.\n\n\nAtheist Perspective:\n\nSuffering is a natural outcome of life, with no inherent purpose or higher meaning.\nComfort may be offered through empathy, but suffering and death are final and lack redemption.\nThe absence of hope beyond the grave can make suffering feel fundamentally meaningless.\n\n\nCore Contrast:\n\nThe atheist sees suffering as an unfortunate fact of existence, while the Christian sees it as part of a broken world destined for restoration by God.\nChristianity offers a redemptive narrative, giving suffering meaning and hope, which the atheist framework lacks.\n\n\nPhilosophical Tension:\n\nChristianity’s ability to provide meaning and hope in suffering raises questions about its origins. Is this a psychological construct created to address existential despair, or is it rooted in truth?\nThe Christian faith invites investigation into its claims, such as the resurrection of Jesus, as evidence of its validity.\n\n\nTakeaway:\n\nThe scenario highlights the profound differences in how faith and secular perspectives approach suffering and meaning. It invites reflection on whether hope and redemption are constructs or deeper truths about existence.\n\n\n\nSuffering of Job\n\nIrony in Job’s Suffering: Job never learns why he suffers, while the reader knows it’s part of a challenge between God and Satan. His friends try to explain his suffering but fail, leaving the reasons unresolved for Job.\nGod’s Response: God speaks from the whirlwind, not offering answers but highlighting Job’s limited perspective and God’s sovereignty. This moment can be seen as a profound revelation of God’s presence or as a stern rebuke.\nComfort in Presence: One interpretation suggests Job finds comfort not in answers but in experiencing God’s overwhelming presence. Others see God’s response as harsh, more about asserting power than offering reassurance.\nPersonal Reflection on Suffering: Links Job’s story to real-life grief, like the loss of a loved one, where comfort comes from believing God is present, even when reasons for suffering remain elusive.\nDoubt and Evidence: The story resonates with Doubting Thomas, where faith is preceded by evidence. Job’s encounter with God parallels Thomas’s encounter with the risen Jesus—both moments demand faith but also provide a tangible experience of God’s presence.\nTakeaway: Job wrestles with the tension between divine mystery and human longing for understanding, offering layered insights into faith and suffering.\n\nThe lesson from Job that “God is with us” highlights that while Job never learns why he suffers, he experiences God’s overwhelming presence. God’s response from the whirlwind doesn’t provide answers but reveals His sovereignty and care. This teaches that comfort in suffering comes not from understanding the “why” but from knowing that God is present, sustaining, and walking with us through pain, offering hope and assurance beyond the suffering itself.\nNotes on Doubting Thomas vs Job\n\nThe Story of Doubting Thomas:\n\nThomas doubted the resurrection of Jesus until he could physically see and touch Jesus’ wounds (John 20:24-29).\nJesus provided evidence—inviting Thomas to touch His hands and side—before encouraging faith: “Stop doubting and believe.”\n\n\nFaith and Evidence:\n\nThe narrative parallels Job’s experience, where evidence of God’s power and sovereignty is given before rebuking doubt.\nBoth stories highlight that while faith is encouraged, it often comes after some form of tangible or experiential encounter with the divine.\n\n\nGod’s Response to Doubt:\n\nJesus’ approach to Thomas is compassionate, meeting him where he is in his doubt but also calling him to move beyond it.\nThis demonstrates that doubt is not condemned outright but is part of a journey toward deeper faith.\n\n\nRelevance to Believers:\n\nLike Thomas, believers may wrestle with doubt and seek evidence of God’s presence.\nThe story reassures that God responds to honest doubt with understanding, often providing what is needed to strengthen faith.\n\n\n\n\nTags:ChristianityChristianityResearch\r\nStatus::initial\r\nThemes:\r\nReferences:"},"Themes/Artificial-Intelligence":{"title":"Artificial Intelligence","links":[],"tags":[],"content":""},"Themes/Autonomy-vs.-Instrumentalisation":{"title":"Autonomy vs. Instrumentalisation","links":[],"tags":[],"content":""},"Themes/Blogging":{"title":"Blogging","links":[],"tags":[],"content":""},"Themes/Capitalism-and-Class-Struggle":{"title":"Capitalism and Class Struggle","links":[],"tags":[],"content":""},"Themes/Daily-Notes":{"title":"Daily Notes","links":[],"tags":[],"content":"List of daily notes\nbacklinks\n"},"Themes/Dystopian-Themes-in-Science-Fiction":{"title":"Dystopian Themes in Science Fiction","links":[],"tags":[],"content":""},"Themes/Environment-Design":{"title":"Environment Design","links":[],"tags":[],"content":""},"Themes/Ethics-of-Warfare":{"title":"Ethics of Warfare","links":[],"tags":[],"content":""},"Themes/Existentialist-Philosophy":{"title":"Existentialist Philosophy","links":[],"tags":[],"content":""},"Themes/Focus-on-Identity-over-Goals":{"title":"Focus on Identity over Goals","links":[],"tags":[],"content":""},"Themes/Game-Theory":{"title":"Game Theory","links":[],"tags":[],"content":""},"Themes/Isaac":{"title":"Isaac","links":[],"tags":[],"content":"temp"},"Themes/Lists":{"title":"Lists","links":[],"tags":[],"content":"Lists - many and varied"},"Themes/Moral-Philosophy":{"title":"Moral Philosophy","links":[],"tags":[],"content":""},"Themes/MyTheology":{"title":"MyTheology","links":[],"tags":[],"content":""},"Themes/Post-Humanist-Ethics":{"title":"Post-Humanist Ethics","links":[],"tags":[],"content":""},"Themes/Redemption-Arcs-in-Literature":{"title":"Redemption Arcs in Literature","links":[],"tags":[],"content":""},"Themes/Rules":{"title":"Rules","links":["Main-Notes/Isaac/1.-Rules/Rule-1---Have-Faith","Main-Notes/Isaac/1.-Rules/Rule-2---Be-nice...-love!","Main-Notes/Isaac/1.-Rules/Rule-3---Work-hard","Main-Notes/Isaac/1.-Rules/Rule-4---Strive...always","Main-Notes/Isaac/1.-Rules/Rule-5---Forgiveness","Main-Notes/Isaac/1.-Rules/Rule-6---Gratefulness","Main-Notes/Isaac/1.-Rules/Rule-7---Humility","Main-Notes/Isaac/1.-Rules/Rule-8---Hospitality","Main-Notes/Isaac/1.-Rules/Rule-9---Moderation","Main-Notes/Isaac/1.-Rules/Rule-10---Discipline--and--Prudence","Main-Notes/Isaac/1.-Rules/Rule-11---Faireness-(Justice--and--Charity)","Main-Notes/Isaac/1.-Rules/Rule-12---Fortitude-(Courage--and--Patience)","Main-Notes/Isaac/1.-Rules/Rule-13---Hope","Main-Notes/Isaac/1.-Rules/Rule-14---Be-a-rebel"],"tags":[],"content":"List of general rules and life lessons.\nRule 1 - Have Faith\nRule 2 - Be nice… love!\nRule 3 - Work hard\nRule 4 - Strive…always\nRule 5 - Forgiveness\nRule 6 - Gratefulness\nRule 7 - Humility\nRule 8 - Hospitality\nRule 9 - Moderation\nRule 10 - Discipline &amp; Prudence\nRule 11 - Faireness (Justice &amp; Charity)\nRule 12 - Fortitude (Courage &amp; Patience)\nRule 13 - Hope\nRule 14 - Be a rebel"},"Themes/Small-Changes,-Big-Impact":{"title":"Small Changes, Big Impact","links":[],"tags":[],"content":""},"Themes/Social-Structures":{"title":"Social Structures","links":[],"tags":[],"content":""},"Themes/Utopian-Literature":{"title":"Utopian Literature","links":[],"tags":[],"content":""},"Themes/War-Literature":{"title":"War Literature","links":[],"tags":[],"content":""},"_assets/Templates/Daily-Entry":{"title":"Daily Entry","links":["Links--and--Lists/BIG-Decision-List","Links--and--Lists/Task-List","Main-Notes/Church/Prayer-List","tags/DailyNote","tags/Ready","Themes/Daily-Notes"],"tags":["DailyNote","Ready"],"content":"General thoughts on today\nLocation::\nBIG Decision List\nTask List\nGod\nPrayer List\nExercise\nPush-ups::\nFree squats::\nComputer\nTV\nFood\nLife\n\ntitle: Daily Notes -\ndraft: false\ntags:DailyNote\nStatus::Ready\nThemes &amp; links: Daily Notes\n"},"_assets/Templates/Idea":{"title":"Idea","links":["tags/Idea","tags/initial"],"tags":["Idea","initial"],"content":"Date and Source of Inspiration\nRecord the date you captured the idea and any source (e.g., a book, conversation, or observation) that sparked it.\nCore Concept\nA concise summary of the idea, capturing its primary purpose or value.\nContext and Background\nWhy this idea matters to you, or what prompted it. This could include challenges it might address or areas of interest it connects to.\nApplications\nList possible ways to bring the idea to life, whether that’s in writing, a project, or a personal endeavour.\nBenefits and Impact\nNote how this idea could contribute to your life, work, or community. Articulating the potential impact can be motivating and help you prioritise.\nChallenges and Considerations\nPossible obstacles, constraints, or factors you might need to address if you pursue this idea.\nRelated Ideas or Notes\nReference similar or complementary ideas in your Obsidian vault, so you can link insights and build on prior thoughts.\n\nTags:Idea\r\nStatus::initial\r\nThemes:\r\nReferences:"},"_assets/Templates/Rule-Template":{"title":"Rule Template","links":[],"tags":[],"content":"\nTags:\nStatus:\nThemes:"},"copilot-conversations/Hey@20241112_105931":{"title":"Hey@20241112_105931","links":[],"tags":["copilot-conversation"],"content":"user: Hey\n[Timestamp: 2024/11/12 10:59:31]\nai: Error: Model request failed: 404 The model gpt-4o does not exist or you do not have access to it.\n[Timestamp: 2024/11/12 10:59:31]\nuser: hey\n[Timestamp: 2024/11/12 10:59:46]\nai: Error: Model request failed: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, read the docs: platform.openai.com/docs/guides/error-codes/api-errors.\n[Timestamp: 2024/11/12 10:59:47]"},"copilot-conversations/What_key_questions_does_{activeNote}_answer@20241112_110138":{"title":"What_key_questions_does_{activeNote}_answer@20241112_110138","links":[],"tags":["copilot-conversation"],"content":"user: What key questions does {activeNote} answer?\n[Timestamp: 2024/11/12 11:01:38]\nai: Error: Model request failed: 404 The model gpt-4o does not exist or you do not have access to it.\n[Timestamp: 2024/11/12 11:01:39]"},"copilot-conversations/hey@20241112_110957":{"title":"hey@20241112_110957","links":[],"tags":["copilot-conversation"],"content":"user: hey\n[Timestamp: 2024/11/12 11:09:57]\nai: Error: Model request failed: 404 The model gpt-4o does not exist or you do not have access to it.\n[Timestamp: 2024/11/12 11:09:58]"},"index":{"title":"Welcome to Quartz","links":[],"tags":[],"content":"This is a blank Quartz installation.\nSee the documentation for how to get started."}}